{"paperId": "223d97f0fe491c66508369b7f096b36344c2e698", "title": "Adapting User Interfaces with Model-based Reinforcement Learning", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 102, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3411764.3445497", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2103.06807, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-03-11", "authors": [{"authorId": "1817239", "name": "Kashyap Todi"}, {"authorId": "1693915", "name": "G. Bailly"}, {"authorId": "145800450", "name": "Luis A. Leiva"}, {"authorId": "2663734", "name": "Antti Oulasvirta"}], "abstract": "Adapting an interface requires taking into account both the positive and negative effects that changes may have on the user. A carelessly picked adaptation may impose high costs to the user – for example, due to surprise or relearning effort – or “trap” the process to a suboptimal design immaturely. However, effects on users are hard to predict as they depend on factors that are latent and evolve over the course of interaction. We propose a novel approach for adaptive user interfaces that yields a conservative adaptation policy: It finds beneficial changes when there are such and avoids changes when there are none. Our model-based reinforcement learning method plans sequences of adaptations and consults predictive HCI models to estimate their effects. We present empirical and simulation results from the case of adaptive menus, showing that the method outperforms both a non-adaptive and a frequency-based policy.", "corpusId": "232185198"}
{"paperId": "1ef2085efff6a527420a0b89f16556b64e5f7483", "title": "How Ready is Your Ready? Assessing the Usability of Incident Response Playbook Frameworks", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "citationCount": 26, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3491102.3517559", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3491102.3517559?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3491102.3517559, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-29", "authors": [{"authorId": "40362961", "name": "Rock Stevens"}, {"authorId": "3157105", "name": "Daniel Votipka"}, {"authorId": "8547995", "name": "J. Dykstra"}, {"authorId": "2160859000", "name": "Fernando Tomlinson"}, {"authorId": "2160859600", "name": "Erin Quartararo"}, {"authorId": "51193532", "name": "Colin Ahern"}, {"authorId": "37176218", "name": "Michelle L. Mazurek"}], "abstract": "Incident response playbooks provide step-by-step guidelines to help security operations personnel quickly respond to specific threat scenarios. Although playbooks are common in the security industry, they have not been empirically evaluated for effectiveness. This paper takes a first step toward measuring playbooks and the frameworks used to design them, using two studies conducted in an enterprise environment. In the first study, twelve security professionals created two playbooks each, using two standard playbook design frameworks; the resulting playbooks were evaluated by experts for accuracy. In the second, we observed five personnel using the created playbooks in no-notice threat exercises within a live security-operations center. We find that playbooks can help simplify and support incident response efforts. However, playbooks designed using the frameworks we examined often lack sufficient detail for real-world use, particularly for more junior technicians. We provide recommendations for improving playbooks, playbook frameworks, and organizational processes surrounding playbook use.", "corpusId": "247836944"}
{"paperId": "e4dd6650497ce07d78ea4f57ea1434f4a3e3f771", "title": "Sparsity and Sentence Structure in Encoder-Decoder Attention of Summarization Systems", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 5, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.739.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2109.03888, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-08", "authors": [{"authorId": "89355510", "name": "Potsawee Manakul"}, {"authorId": "1740397", "name": "M. Gales"}], "abstract": "Transformer models have achieved state-of-the-art results in a wide range of NLP tasks including summarization. Training and inference using large transformer models can be computationally expensive. Previous work has focused on one important bottleneck, the quadratic self-attention mechanism in the encoder. Modified encoder architectures such as LED or LoBART use local attention patterns to address this problem for summarization. In contrast, this work focuses on the transformer’s encoder-decoder attention mechanism. The cost of this attention becomes more significant in inference or training approaches that require model-generated histories. First, we examine the complexity of the encoder-decoder attention. We demonstrate empirically that there is a sparse sentence structure in document summarization that can be exploited by constraining the attention mechanism to a subset of input sentences, whilst maintaining system performance. Second, we propose a modified architecture that selects the subset of sentences to constrain the encoder-decoder attention. Experiments are carried out on abstractive summarization tasks, including CNN/DailyMail, XSum, Spotify Podcast, and arXiv.", "corpusId": "237452204"}
{"paperId": "c3b439fa8d6f52b762cda47e31c051b76437b126", "title": "Data Augmentation for Cross-Domain Named Entity Recognition", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 50, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.434.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2109.01758, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-04", "authors": [{"authorId": "48848036", "name": "Shuguang Chen"}, {"authorId": "46402847", "name": "Gustavo Aguilar"}, {"authorId": "152842060", "name": "Leonardo Neves"}, {"authorId": "1794626", "name": "T. Solorio"}], "abstract": "Current work in named entity recognition (NER) shows that data augmentation techniques can produce more robust models. However, most existing techniques focus on augmenting in-domain data in low-resource scenarios where annotated data is quite limited. In this work, we take this research direction to the opposite and study cross-domain data augmentation for the NER task. We investigate the possibility of leveraging data from high-resource domains by projecting it into the low-resource domains. Specifically, we propose a novel neural architecture to transform the data representation from a high-resource to a low-resource domain by learning the patterns (e.g. style, noise, abbreviations, etc.) in the text that differentiate them and a shared feature space where both domains are aligned. We experiment with diverse datasets and show that transforming the data to the low-resource domain representation achieves significant improvements over only using data from high-resource domains.", "corpusId": "237420553"}
{"paperId": "323be28da915fef62ef24c6efb891d5103504bad", "title": "Valency-Augmented Dependency Parsing", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2018, "citationCount": 4, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D18-1159.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/D18-1159, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "2929835", "name": "Tianze Shi"}, {"authorId": "145810617", "name": "Lillian Lee"}], "abstract": "We present a complete, automated, and efficient approach for utilizing valency analysis in making dependency parsing decisions. It includes extraction of valency patterns, a probabilistic model for tagging these patterns, and a joint decoding process that explicitly considers the number and types of each token’s syntactic dependents. On 53 treebanks representing 41 languages in the Universal Dependencies data, we find that incorporating valency information yields higher precision and F1 scores on the core arguments (subjects and complements) and functional relations (e.g., auxiliaries) that we employ for valency analysis. Precision on core arguments improves from 80.87 to 85.43. We further show that our approach can be applied to an ostensibly different formalism and dataset, Tree Adjoining Grammar as extracted from the Penn Treebank; there, we outperform the previous state-of-the-art labeled attachment score by 0.7. Finally, we explore the potential of extending valency patterns beyond their traditional domain by confirming their helpfulness in improving PP attachment decisions.", "corpusId": "53081486"}
{"paperId": "1bc2d9a76c03133695ce39ead973152732b7330c", "title": "“I am both here and there” Parallel Control of Multiple Robotic Avatars by Disabled Workers in a Café", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "citationCount": 25, "openAccessPdf": {"url": "https://arxiv.org/pdf/2303.13831", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2303.13831, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2023-03-24", "authors": [{"authorId": "2353282147", "name": "Giulia Barbareschi"}, {"authorId": "66798730", "name": "Midori Kawaguchi"}, {"authorId": "2212186984", "name": "Hiroki Kato"}, {"authorId": "2200188732", "name": "Masato Nagahiro"}, {"authorId": "2212793605", "name": "Kazuaki Takehuchi"}, {"authorId": "2200189789", "name": "Yoshifumi Shiiba"}, {"authorId": "2622335", "name": "Shunichi Kasahara"}, {"authorId": "143973307", "name": "K. Kunze"}, {"authorId": "1711743", "name": "K. Minamizawa"}], "abstract": "Robotic avatars can help disabled people extend their reach in interacting with the world. Technological advances make it possible for individuals to embody multiple avatars simultaneously. However, existing studies have been limited to laboratory conditions and did not involve disabled participants. In this paper, we present a real-world implementation of a parallel control system allowing disabled workers in a café to embody multiple robotic avatars at the same time to carry out different tasks. Our data corpus comprises semi-structured interviews with workers, customer surveys, and videos of café operations. Results indicate that the system increases workers’ agency, enabling them to better manage customer journeys. Parallel embodiment and transitions between avatars create multiple interaction loops where the links between disabled workers and customers remain consistent, but the intermediary avatar changes. Based on our observations, we theorize that disabled individuals possess specific competencies that increase their ability to manage multiple avatar bodies.", "corpusId": "257756898"}
{"paperId": "0f283c9c637d1e5098bd93f5d14d725b45641ebf", "title": "Detecting Gang-Involved Escalation on Social Media Using Context", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2018, "citationCount": 21, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D18-1005.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1809.03632, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-10", "authors": [{"authorId": "22369664", "name": "Serina Chang"}, {"authorId": "51011000", "name": "Ruiqi Zhong"}, {"authorId": "121571466", "name": "E. Adams"}, {"authorId": "51151630", "name": "Fei-Tzin Lee"}, {"authorId": "51152757", "name": "Siddharth Varia"}, {"authorId": "2767140", "name": "D. Patton"}, {"authorId": "46733376", "name": "William R. Frey"}, {"authorId": "2905377", "name": "Chris Kedzie"}, {"authorId": "145590324", "name": "K. McKeown"}], "abstract": "Gang-involved youth in cities such as Chicago have increasingly turned to social media to post about their experiences and intents online. In some situations, when they experience the loss of a loved one, their online expression of emotion may evolve into aggression towards rival gangs and ultimately into real-world violence. In this paper, we present a novel system for detecting Aggression and Loss in social media. Our system features the use of domain-specific resources automatically derived from a large unlabeled corpus, and contextual representations of the emotional and semantic content of the user’s recent tweets as well as their interactions with other users. Incorporating context in our Convolutional Neural Network (CNN) leads to a significant improvement.", "corpusId": "52191391"}
{"paperId": "f9c5f7e7847f24aa89a2250d053a8bc1b0aa84e4", "title": "Perspective on and Re-orientation of Physical Proxies in Object-Focused Remote Collaboration", "venue": "International Conference on Human Factors in Computing Systems", "year": 2018, "citationCount": 23, "openAccessPdf": {"url": "https://ink.library.smu.edu.sg/context/sis_research/article/8979/viewcontent/3173574.3173855.pdf", "status": "GREEN", "license": "CCBYNCND", "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3173574.3173855?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3173574.3173855, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-04-21", "authors": [{"authorId": "36817161", "name": "Martin Feick"}, {"authorId": "40963345", "name": "T. Mok"}, {"authorId": "143620808", "name": "Anthony Tang"}, {"authorId": "1760608", "name": "L. Oehlberg"}, {"authorId": "1800680", "name": "Ehud Sharlin"}], "abstract": "Remote collaborators working together on physical objects have difficulty building a shared understanding of what each person is talking about. Conventional video chat systems are insufficient for many situations because they present a single view of the object in a flattened image. To understand how this limited perspective affects collaboration, we designed the Remote Manipulator (ReMa), which can reproduce orientation manipulations on a proxy object at a remote site. We conducted two studies with ReMa, with two main findings. First, a shared perspective is more effective and preferred compared to the opposing perspective offered by conventional video chat systems. Second, the physical proxy and video chat complement one another in a combined system: people used the physical proxy to understand objects, and used video chat to perform gestures and confirm remote actions.", "corpusId": "3355133"}
{"paperId": "1b46f99a9c1b481cfa4cf7cf50e994bb9cc0b2d9", "title": "Structural Constraints and Natural Language Inference for End-to-End Flowchart Grounded Dialog Response Generation", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 3, "openAccessPdf": {"url": "https://aclanthology.org/2022.emnlp-main.739.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2022.emnlp-main.739, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "1916865", "name": "Dinesh Raghu"}, {"authorId": "2114035331", "name": "Suraj Joshi"}, {"authorId": "1703799", "name": "Sachindra Joshi"}, {"authorId": "2345659242", "name": "Mausam -"}], "abstract": "Flowchart grounded dialog systems converse with users by following a given flowchart and a corpus of FAQs. The existing state-of-the-art approach (Raghu et al, 2021) for learning such a dialog system, named FLONET, has two main limitations. (1) It uses a Retrieval Augmented Generation (RAG) framework which represents a flowchart as a bag of nodes. By doing so, it loses the connectivity structure between nodes that can aid in better response generation. (2) Typically dialogs progress with the agent asking polar (Y/N) questions, but users often respond indirectly without the explicit use of polar words. In such cases, it fails to understand the correct polarity of the answer. To overcome these issues, we propose Structure-Aware FLONET (SA-FLONET) which infuses structural constraints derived from the connectivity structure of flowcharts into the RAG framework. It uses natural language inference to better predict the polarity of indirect Y/N answers. We find that SA-FLONET outperforms FLONET, with a success rate improvement of 68% and 123% in flowchart grounded response generation and zero-shot flowchart grounded response generation tasks respectively.", "corpusId": "256461417"}
{"paperId": "39dde3d0e00b2820e52e5badb52cb70691c3423d", "title": "Wall++: Room-Scale Interactive and Context-Aware Sensing", "venue": "International Conference on Human Factors in Computing Systems", "year": 2018, "citationCount": 124, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3173574.3173847?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3173574.3173847, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-04-21", "authors": [{"authorId": "2145953811", "name": "Yang Zhang"}, {"authorId": "1735064", "name": "Chouchang Yang"}, {"authorId": "1749296", "name": "Scott E. Hudson"}, {"authorId": "145078227", "name": "Chris Harrison"}, {"authorId": "1749219", "name": "A. Sample"}], "abstract": null, "corpusId": "5050052"}
{"paperId": "b48cccff66c21fb5b5fa8fe6f73311118f7cef61", "title": "Using Stakeholder Theory to Examine Drivers' Stake in Uber", "venue": "International Conference on Human Factors in Computing Systems", "year": 2018, "citationCount": 48, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3173574.3173657?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3173574.3173657, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-04-19", "authors": [{"authorId": "47582426", "name": "Ning F. Ma"}, {"authorId": "9802859", "name": "Tina Chien-Wen Yuan"}, {"authorId": "3372144", "name": "Moojan Ghafurian"}, {"authorId": "2696789", "name": "Benjamin V. Hanrahan"}], "abstract": null, "corpusId": "5039031"}
{"paperId": "9db03509f2a8917dc4135c0a7dfc4ff7274f533d", "title": "Neural Attention-Aware Hierarchical Topic Model", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 19, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.80.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2110.07161, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-14", "authors": [{"authorId": "2110894738", "name": "Yuan Jin"}, {"authorId": "1643682004", "name": "He Zhao"}, {"authorId": "2112748109", "name": "Ming Liu"}, {"authorId": "2068124441", "name": "Lan Du"}, {"authorId": "70219052", "name": "Wray L. Buntine"}], "abstract": "Neural topic models (NTMs) apply deep neural networks to topic modelling. Despite their success, NTMs generally ignore two important aspects: (1) only document-level word count information is utilized for the training, while more fine-grained sentence-level information is ignored, and (2) external semantic knowledge regarding documents, sentences and words are not exploited for the training. To address these issues, we propose a variational autoencoder (VAE) NTM model that jointly reconstructs the sentence and document word counts using combinations of bag-of-words (BoW) topical embeddings and pre-trained semantic embeddings. The pre-trained embeddings are first transformed into a common latent topical space to align their semantics with the BoW embeddings. Our model also features hierarchical KL divergence to leverage embeddings of each document to regularize those of their sentences, paying more attention to semantically relevant sentences. Both quantitative and qualitative experiments have shown the efficacy of our model in 1) lowering the reconstruction errors at both the sentence and document levels, and 2) discovering more coherent topics from real-world datasets.", "corpusId": "238856694"}
{"paperId": "33cc6d93cd86a488b00224cfbec1f31723d0693b", "title": "Determining Relative Argument Specificity and Stance for Complex Argumentative Structures", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2019, "citationCount": 19, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P19-1456.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1906.11313, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-06-01", "authors": [{"authorId": "41152329", "name": "Esin Durmus"}, {"authorId": "8759332", "name": "Faisal Ladhak"}, {"authorId": "1748501", "name": "Claire Cardie"}], "abstract": "Systems for automatic argument generation and debate require the ability to (1) determine the stance of any claims employed in the argument and (2) assess the specificity of each claim relative to the argument context. Existing work on understanding claim specificity and stance, however, has been limited to the study of argumentative structures that are relatively shallow, most often consisting of a single claim that directly supports or opposes the argument thesis. In this paper, we tackle these tasks in the context of complex arguments on a diverse set of topics. In particular, our dataset consists of manually curated argument trees for 741 controversial topics covering 95,312 unique claims; lines of argument are generally of depth 2 to 6. We find that as the distance between a pair of claims increases along the argument path, determining the relative specificity of a pair of claims becomes easier and determining their relative stance becomes harder.", "corpusId": "195699602"}
{"paperId": "9d683580050876a25624511b7c53676292e04e81", "title": "Iterative Language-Based Image Editing via Self-Supervised Counterfactual Reasoning", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 43, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.emnlp-main.357.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2009.09566, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-21", "authors": [{"authorId": "41020222", "name": "Tsu-Jui Fu"}, {"authorId": "47120131", "name": "X. Wang"}, {"authorId": "3047772", "name": "Scott T. Grafton"}, {"authorId": "1895768", "name": "M. Eckstein"}, {"authorId": "1682479", "name": "William Yang Wang"}], "abstract": "Iterative Language-Based Image Editing (IL-BIE) tasks follow iterative instructions to edit images step by step. Data scarcity is a significant issue for ILBIE as it is challenging to collect large-scale examples of images before and after instruction-based changes. However, humans still accomplish these editing tasks even when presented with an unfamiliar image-instruction pair. Such ability results from counterfactual thinking and the ability to think about alternatives to events that have happened already. In this paper, we introduce a Self-Supervised Counterfactual Reasoning (SSCR) framework that incorporates counterfactual thinking to overcome data scarcity. SSCR allows the model to consider out-of-distribution instructions paired with previous images. With the help of cross-task consistency (CTC), we train these counterfactual instructions in a self-supervised scenario. Extensive results show that SSCR improves the correctness of ILBIE in terms of both object identity and position, establishing a new state of the art (SOTA) on two IBLIE datasets (i-CLEVR and CoDraw). Even with only 50% of the training data, SSCR achieves a comparable result to using complete data.", "corpusId": "221818872"}
{"paperId": "f997c2f1f668b942c4cccd425bc192df651ed516", "title": "Coverage Embedding Models for Neural Machine Translation", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2016, "citationCount": 150, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D16-1096.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/D16-1096, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-05-10", "authors": [{"authorId": "2013337", "name": "Haitao Mi"}, {"authorId": "38665506", "name": "B. Sankaran"}, {"authorId": "40296541", "name": "Zhiguo Wang"}, {"authorId": "3407108", "name": "Abe Ittycheriah"}], "abstract": "In this paper, we enhance the attention-based neural machine translation (NMT) by adding explicit coverage embedding models to alleviate issues of repeating and dropping translations in NMT. For each source word, our model starts with a full coverage embedding vector to track the coverage status, and then keeps updating it with neural networks as the translation goes. Experiments on the large-scale Chinese-to-English task show that our enhanced model improves the translation quality significantly on various test sets over the strong large vocabulary NMT system.", "corpusId": "14900221"}
{"paperId": "3fc916ec2bcb6ae8c58aa5edd7e272a2d31bb7fa", "title": "Ladange, Adange, Jeetange: The Farmers' Movement and Its Virtual Spaces", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "citationCount": 4, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3555547?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3555547, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-07", "authors": [{"authorId": "2122332643", "name": "Paridhi Gupta"}, {"authorId": "2181543795", "name": "Adrian Petterson"}, {"authorId": "2190505180", "name": "Divyani Motla"}, {"authorId": "40486345", "name": "Priyank Chandra"}], "abstract": "The farmers' movement began in November 2020, when more than 300,000 protesters marched towards New Delhi in India in opposition to new agrarian acts introduced by the Indian central government. Organised by over 400 farmers' unions along with other organisations, for the next year, farmers and allied protesters set up bases around New Delhi and sustained the movement leading to its eventual success. We conducted 20 semi-structured interviews with participants from the movement and explored the social organisation, the underlying technical infrastructures, and how collective action was organised. We outline how the social media ecosystem enabled hybrid forms of organisational structures and facilitated coalition-building between diverse groups. Further, the movement created and disseminated alternative media that opposed mainstream media narratives and facilitated community-building. We discuss how designed technologies and spaces can support social movements in the face of powerful antagonistic actors.", "corpusId": "253460253"}
{"paperId": "0c97d554dc4890c410bf92c36aeead9db32c8d4a", "title": "Towards Leveraging AI-based Moderation to Address Emergent Harassment in Social Virtual Reality", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "citationCount": 46, "openAccessPdf": {"url": "https://doi.org/10.1145/3544548.3581090", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3544548.3581090?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3544548.3581090, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-04-19", "authors": [{"authorId": "2149925900", "name": "Kelsea Schulenberg"}, {"authorId": "2004044575", "name": "Lingyuan Li"}, {"authorId": "51182865", "name": "Guo Freeman"}, {"authorId": "71183233", "name": "Samaneh Zamanifard"}, {"authorId": "2171978", "name": "Nathan J. Mcneese"}], "abstract": "Extensive HCI research has investigated how to prevent and mitigate harassment in virtual spaces, particularly by leveraging human-based and Artificial Intelligence (AI)-based moderation. However, social Virtual Reality (VR) constitutes a novel social space that faces both intensified harassment challenges and a lack of consensus on how moderation should be approached to address such harassment. Drawing on 39 interviews with social VR users with diverse backgrounds, we investigate the perceived opportunities and limitations for leveraging AI-based moderation to address emergent harassment in social VR, and how future AI moderators can be designed to enhance such opportunities and address limitations. We provide the first empirical investigation into re-envisioning AI’s new roles in innovating content moderation approaches to better combat harassment in social VR. We also highlight important principles for designing future AI-based moderation incorporating user-human-AI collaboration to achieve safer and more nuanced online spaces.", "corpusId": "258218306"}
{"paperId": "88686d6c026cbfbeb204c16cd8f8dafe941f6790", "title": "Pick me!: Getting Noticed on Google Play", "venue": "International Conference on Human Factors in Computing Systems", "year": 2016, "citationCount": 15, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/2858036.2858552?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/2858036.2858552, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2016-05-07", "authors": [{"authorId": "3252466", "name": "Aliaksei Miniukovich"}, {"authorId": "34919047", "name": "A. D. Angeli"}], "abstract": null, "corpusId": "16697202"}
{"paperId": "2a488da9560d9466edfe76adb484179f83fa3e9b", "title": "Interpretability for Language Learners Using Example-Based Grammatical Error Correction", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "citationCount": 26, "openAccessPdf": {"url": "http://arxiv.org/pdf/2203.07085", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2203.07085, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-14", "authors": [{"authorId": "143655216", "name": "Masahiro Kaneko"}, {"authorId": "33544449", "name": "Sho Takase"}, {"authorId": "2005709143", "name": "Ayana Niwa"}, {"authorId": "1764004", "name": "Naoaki Okazaki"}], "abstract": "Grammatical Error Correction (GEC) should not focus only on high accuracy of corrections but also on interpretability for language learning.However, existing neural-based GEC models mainly aim at improving accuracy, and their interpretability has not been explored.A promising approach for improving interpretability is an example-based method, which uses similar retrieved examples to generate corrections. In addition, examples are beneficial in language learning, helping learners understand the basis of grammatically incorrect/correct texts and improve their confidence in writing.Therefore, we hypothesize that incorporating an example-based method into GEC can improve interpretability as well as support language learners.In this study, we introduce an Example-Based GEC (EB-GEC) that presents examples to language learners as a basis for a correction result.The examples consist of pairs of correct and incorrect sentences similar to a given input and its predicted correction.Experiments demonstrate that the examples presented by EB-GEC help language learners decide to accept or refuse suggestions from the GEC output.Furthermore, the experiments also show that retrieved examples improve the accuracy of corrections.", "corpusId": "247447305"}
{"paperId": "e512396a6bf7e5c183be956dea8962e688a8f732", "title": "Fixing Translation Divergences in Parallel Corpora for Neural MT", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2018, "citationCount": 17, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D18-1328.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/D18-1328, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "144933489", "name": "M. Pham"}, {"authorId": "2209023", "name": "J. Crego"}, {"authorId": "3053934", "name": "Jean Senellart"}, {"authorId": "1846431", "name": "François Yvon"}], "abstract": "Corpus-based approaches to machine translation rely on the availability of clean parallel corpora. Such resources are scarce, and because of the automatic processes involved in their preparation, they are often noisy. This paper describes an unsupervised method for detecting translation divergences in parallel sentences. We rely on a neural network that computes cross-lingual sentence similarity scores, which are then used to effectively filter out divergent translations. Furthermore, similarity scores predicted by the network are used to identify and fix some partial divergences, yielding additional parallel segments. We evaluate these methods for English-French and English-German machine translation tasks, and show that using filtered/corrected corpora actually improves MT performance.", "corpusId": "53080385"}
{"paperId": "ef0e11df5452cbaeaaafa0e839647ca5d757e676", "title": "Integrating Order Information and Event Relation for Script Event Prediction", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2017, "citationCount": 76, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D17-1006.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/D17-1006, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-09-01", "authors": [{"authorId": "116326671", "name": "Zhongqing Wang"}, {"authorId": null, "name": "Yue Zhang"}, {"authorId": "1728955", "name": "Ching-Yun Chang"}], "abstract": "There has been a recent line of work automatically learning scripts from unstructured texts, by modeling narrative event chains. While the dominant approach group events using event pair relations, LSTMs have been used to encode full chains of narrative events. The latter has the advantage of learning long-range temporal orders, yet the former is more adaptive to partial orders. We propose a neural model that leverages the advantages of both methods, by using LSTM hidden states as features for event pair modelling. A dynamic memory network is utilized to automatically induce weights on existing events for inferring a subsequent event. Standard evaluation shows that our method significantly outperforms both methods above, giving the best results reported so far.", "corpusId": "38934160"}
{"paperId": "6d06dbda28069c4aa86721d0f06b83ab1a30232e", "title": "Cross-Lingual Dependency Parsing Using Code-Mixed TreeBank", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2019, "citationCount": 40, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D19-1092.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1909.02235, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-05", "authors": [{"authorId": "2678094", "name": "Meishan Zhang"}, {"authorId": "2096969631", "name": "Zhang Meishan"}, {"authorId": "2068672157", "name": "Zhang Yue"}, {"authorId": "31060997", "name": "Fu Guo-hong"}], "abstract": "Treebank translation is a promising method for cross-lingual transfer of syntactic dependency knowledge. The basic idea is to map dependency arcs from a source treebank to its target translation according to word alignments. This method, however, can suffer from imperfect alignment between source and target words. To address this problem, we investigate syntactic transfer by code mixing, translating only confident words in a source treebank. Cross-lingual word embeddings are leveraged for transferring syntactic knowledge to the target from the resulting code-mixed treebank. Experiments on University Dependency Treebanks show that code-mixed treebanks are more effective than translated treebanks, giving highly competitive performances among cross-lingual parsing methods.", "corpusId": "202541341"}
{"paperId": "19b4ee59cd4e1d26fbe63cca87d28341faefa17d", "title": "Trajectories of Engagement and Disengagement with a Story-Based Smoking Cessation App", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 39, "openAccessPdf": {"url": "https://eprints.qut.edu.au/106703/1/C34%20CHI2017%20trajectories%20of%20engagement.pdf", "status": "GREEN", "license": "public-domain", "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3026054?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3026054, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "145006932", "name": "Wally Smith"}, {"authorId": "1715637", "name": "Bernd Ploderer"}, {"authorId": "1931607", "name": "G. Wadley"}, {"authorId": "5079971", "name": "S. Webber"}, {"authorId": "145106860", "name": "R. Borland"}], "abstract": null, "corpusId": "21805758"}
{"paperId": "0ebb1d1fbf488fba8c18a5a6057a6ccd9e87510f", "title": "Learning Music Helps You Read: Using Transfer to Study Linguistic Structure in Language Models", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 70, "openAccessPdf": {"url": "http://arxiv.org/pdf/2004.14601", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2020.emnlp-main.554, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-30", "authors": [{"authorId": "1665756307", "name": "Isabel Papadimitriou"}, {"authorId": "1746807", "name": "Dan Jurafsky"}], "abstract": "We propose transfer learning as a method for analyzing the encoding of grammatical structure in neural language models. We train LSTMs on non-linguistic data and evaluate their performance on natural language to assess which kinds of data induce generalizable structural features that LSTMs can use for natural language. We find that training on non-linguistic data with latent structure (MIDI music or Java code) improves test performance on natural language, despite no overlap in surface form or vocabulary. Training on artificial languages containing recursion (hierarchical structure) also improves performance on natural language, again with no vocabulary overlap. Surprisingly, training on artificial languages consisting of sets of separated pairs of words, but with no recursion, improves performance on natural language as well as recursive languages do. Experiments on transfer between natural languages show that zero-shot performance on a test language is highly correlated with typological syntactic similarity to the training language, suggesting that representations induced from natural languages correspond to the cross-linguistic syntactic properties studied in linguistic typology. Our results provide insights into the ways that neural models represent abstract syntactic structure, and also about the kind of structural inductive biases which a learner needs to model language.", "corpusId": "221891676"}
{"paperId": "65b20b3e6f81f6567e41e353a47a2380c6cc4b77", "title": "Text-Free Prosody-Aware Generative Spoken Language Modeling", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2021, "citationCount": 135, "openAccessPdf": {"url": "https://aclanthology.org/2022.acl-long.593.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2109.03264, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-07", "authors": [{"authorId": "144875326", "name": "E. Kharitonov"}, {"authorId": "145732777", "name": "Ann Lee"}, {"authorId": "33964593", "name": "Adam Polyak"}, {"authorId": "2727584", "name": "Yossi Adi"}, {"authorId": "1805998294", "name": "Jade Copet"}, {"authorId": "1410624139", "name": "Kushal Lakhotia"}, {"authorId": "2116225477", "name": "Tu Nguyen"}, {"authorId": "46928736", "name": "M. Rivière"}, {"authorId": "40360972", "name": "Abdel-rahman Mohamed"}, {"authorId": "90049550", "name": "Emmanuel Dupoux"}, {"authorId": "2957796", "name": "Wei-Ning Hsu"}], "abstract": "Speech pre-training has primarily demonstrated efficacy on classification tasks, while its capability of generating novel speech, similar to how GPT-2 can generate coherent paragraphs, has barely been explored. Generative Spoken Language Modeling (GSLM) (CITATION) is the only prior work addressing the generative aspect of speech pre-training, which builds a text-free language model using discovered units. Unfortunately, because the units used in GSLM discard most prosodic information, GSLM fails to leverage prosody for better comprehension and does not generate expressive speech. In this work, we present a prosody-aware generative spoken language model (pGSLM). It is composed of a multi-stream transformer language model (MS-TLM) of speech, represented as discovered unit and prosodic feature streams, and an adapted HiFi-GAN model converting MS-TLM outputs to waveforms. Experimental results show that the pGSLM can utilize prosody to improve both prosody and content modeling, and also generate natural, meaningful, and coherent speech given a spoken prompt. Audio samples can be found at https://speechbot.github.io/pgslm. Codes and models are available at https://github.com/pytorch/fairseq/tree/main/examples/textless_nlp/pgslm.", "corpusId": "237439400"}
{"paperId": "4260a9214dc23ce8149cf966ecf047d54597d798", "title": "Judge the Judges: A Large-Scale Evaluation Study of Neural Language Models for Online Review Generation", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2019, "citationCount": 31, "openAccessPdf": {"url": "https://arxiv.org/pdf/1901.00398", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1901.00398, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-01-02", "authors": [{"authorId": "3360992", "name": "Cristina Garbacea"}, {"authorId": "40502796", "name": "Samuel Carton"}, {"authorId": "2111617426", "name": "Shiyan Yan"}, {"authorId": "1743469", "name": "Qiaozhu Mei"}], "abstract": "We conduct a large-scale, systematic study to evaluate the existing evaluation methods for natural language generation in the context of generating online product reviews. We compare human-based evaluators with a variety of automated evaluation procedures, including discriminative evaluators that measure how well machine-generated text can be distinguished from human-written text, as well as word overlap metrics that assess how similar the generated text compares to human-written references. We determine to what extent these different evaluators agree on the ranking of a dozen of state-of-the-art generators for online product reviews. We find that human evaluators do not correlate well with discriminative evaluators, leaving a bigger question of whether adversarial accuracy is the correct objective for natural language generation. In general, distinguishing machine-generated text is challenging even for human evaluators, and human decisions correlate better with lexical overlaps. We find lexical diversity an intriguing metric that is indicative of the assessments of different evaluators. A post-experiment survey of participants provides insights into how to evaluate and improve the quality of natural language generation systems.", "corpusId": "57373775"}
{"paperId": "7d7834e2a5a505300a5d6feb4f87cc1d2b403009", "title": "Multi-Modal Approaches for Post-Editing Machine Translation", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 22, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300461?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300461, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-05-02", "authors": [{"authorId": "3181259", "name": "Nico Herbig"}, {"authorId": "145244784", "name": "Santanu Pal"}, {"authorId": "7519068", "name": "Josef van Genabith"}, {"authorId": "145263612", "name": "A. Krüger"}], "abstract": "Current advances in machine translation increase the need for translators to switch from traditional translation to post-editing (PE) of machine-translated text, a process that saves time and improves quality. This affects the design of translation interfaces, as the task changes from mainly generating text to correcting errors within otherwise helpful translation proposals. Our results of an elicitation study with professional translators indicate that a combination of pen, touch, and speech could well support common PE tasks, and received high subjective ratings by our participants. Therefore, we argue that future translation environment research should focus more strongly on these modalities in addition to mouse- and keyboard-based approaches. On the other hand, eye tracking and gesture modalities seem less important. An additional interview regarding interface design revealed that most translators would also see value in automatically receiving additional resources when a high cognitive load is detected during PE.", "corpusId": "85513299"}
{"paperId": "f444568c64befd63d857f1007b0357c6f0e4de96", "title": "Learning Concept Taxonomies from Multi-modal Data", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2016, "citationCount": 27, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P16-1169.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1606.09239, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-06-29", "authors": [{"authorId": "1682058", "name": "H. Zhang"}, {"authorId": "2749311", "name": "Zhiting Hu"}, {"authorId": "2505751", "name": "Yuntian Deng"}, {"authorId": "2790926", "name": "Mrinmaya Sachan"}, {"authorId": "3305169", "name": "Zhicheng Yan"}, {"authorId": "143977260", "name": "E. Xing"}], "abstract": "We study the problem of automatically building hypernym taxonomies from textual and visual data. Previous works in taxonomy induction generally ignore the increasingly prominent visual data, which encode important perceptual semantics. Instead, we propose a probabilistic model for taxonomy induction by jointly leveraging text and images. To avoid hand-crafted feature engineering, we design end-to-end features based on distributed representations of images and words. The model is discriminatively trained given a small set of existing ontologies and is capable of building full taxonomies from scratch for a collection of unseen conceptual label items with associated images. We evaluate our model and features on the WordNet hierarchies, where our system outperforms previous approaches by a large gap.", "corpusId": "5326293"}
{"paperId": "a3240c680cb26e6e4a398253e5cfd5c2e4e4d2da", "title": "A Multi-media Approach to Cross-lingual Entity Knowledge Transfer", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2016, "citationCount": 9, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P16-1006.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/P16-1006, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-08-01", "authors": [{"authorId": "144690460", "name": "Di Lu"}, {"authorId": "34741133", "name": "Xiaoman Pan"}, {"authorId": "3158273", "name": "Nima Pourdamghani"}, {"authorId": "9546964", "name": "Shih-Fu Chang"}, {"authorId": "144016781", "name": "Heng Ji"}, {"authorId": "152971314", "name": "Kevin Knight"}], "abstract": "When a large-scale incident or disaster occurs, there is often a great demand for rapidly developing a system to extract detailed and new information from low-resource languages (LLs). We propose a novel approach to discover comparable documents in high-resource languages (HLs), and project Entity Discovery and Linking results from HLs documents back to LLs. We leverage a wide variety of language-independent forms from multiple data modalities, including image processing (image-to-image retrieval, visual similarity and face recognition) and sound matching. We also propose novel meth-ods to learn entity priors from a large-scale HL corpus and knowledge base. Using Hausa and Chinese as the LLs and English as the HL, experiments show that our approach achieves 36.1% higher Hausa name tagging F-score over a costly supervised model, and 9.4% higher Chinese-to-English Entity Linking accuracy over state-of-the-art.", "corpusId": "11547957"}
{"paperId": "a383c093d30803445036bdeb3e0fb9156013f919", "title": "ProtoSound: A Personalized and Scalable Sound Recognition System for Deaf and Hard-of-Hearing Users", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "citationCount": 39, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3491102.3502020", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2202.11134, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2022-02-22", "authors": [{"authorId": "37883312", "name": "D. Jain"}, {"authorId": "2155892742", "name": "Khoa Nguyen"}, {"authorId": "1560353463", "name": "Steven M. Goodman"}, {"authorId": "2155892810", "name": "Rachel Grossman-Kahn"}, {"authorId": "2057895913", "name": "Hung Ngo"}, {"authorId": "52207562", "name": "Aditya Kusupati"}, {"authorId": "36485086", "name": "Ruofei Du"}, {"authorId": "2375159", "name": "A. Olwal"}, {"authorId": "1689620", "name": "Leah Findlater"}, {"authorId": "145904884", "name": "Jon E. Froehlich"}], "abstract": "Recent advances have enabled automatic sound recognition systems for deaf and hard of hearing (DHH) users on mobile devices. However, these tools use pre-trained, generic sound recognition models, which do not meet the diverse needs of DHH users. We introduce ProtoSound, an interactive system for customizing sound recognition models by recording a few examples, thereby enabling personalized and fine-grained categories. ProtoSound is motivated by prior work examining sound awareness needs of DHH people and by a survey we conducted with 472 DHH participants. To evaluate ProtoSound, we characterized performance on two real-world sound datasets, showing significant improvement over state-of-the-art (e.g., +9.7% accuracy on the first dataset). We then deployed ProtoSound's end-user training and real-time recognition through a mobile application and recruited 19 hearing participants who listened to the real-world sounds and rated the accuracy across 56 locations (e.g., homes, restaurants, parks). Results show that ProtoSound personalized the model on-device in real-time and accurately learned sounds across diverse acoustic contexts. We close by discussing open challenges in personalizable sound recognition, including the need for better recording interfaces and algorithmic improvements.", "corpusId": "245382986"}
{"paperId": "4ca430d4640afa4a3838371a08f8f418284bdb7c", "title": "Neural Symbolic Machines: Learning Semantic Parsers on Freebase with Weak Supervision", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2016, "citationCount": 418, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P17-1003.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1611.00020, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-10-31", "authors": [{"authorId": "145246869", "name": "Chen Liang"}, {"authorId": "1750652", "name": "Jonathan Berant"}, {"authorId": "2827616", "name": "Quoc V. Le"}, {"authorId": "1713121", "name": "Kenneth D. Forbus"}, {"authorId": "1914797", "name": "N. Lao"}], "abstract": "Harnessing the statistical power of neural networks to perform language understanding and symbolic reasoning is difficult, when it requires executing efficient discrete operations against a large knowledge-base. In this work, we introduce a Neural Symbolic Machine, which contains (a) a neural “programmer”, i.e., a sequence-to-sequence model that maps language utterances to programs and utilizes a key-variable memory to handle compositionality (b) a symbolic “computer”, i.e., a Lisp interpreter that performs program execution, and helps find good programs by pruning the search space. We apply REINFORCE to directly optimize the task reward of this structured prediction problem. To train with weak supervision and improve the stability of REINFORCE, we augment it with an iterative maximum-likelihood training process. NSM outperforms the state-of-the-art on the WebQuestionsSP dataset when trained from question-answer pairs only, without requiring any feature engineering or domain-specific knowledge.", "corpusId": "2742513"}
{"paperId": "408efdd599b2b27ecb95a4d799869c9ff568fb31", "title": "ReCLIP: A Strong Zero-Shot Baseline for Referring Expression Comprehension", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "citationCount": 148, "openAccessPdf": {"url": "http://arxiv.org/pdf/2204.05991", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2204.05991, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-12", "authors": [{"authorId": "17097887", "name": "Sanjay Subramanian"}, {"authorId": "143696607", "name": "William Merrill"}, {"authorId": "1753210", "name": "Trevor Darrell"}, {"authorId": "40642935", "name": "Matt Gardner"}, {"authorId": "34650964", "name": "Sameer Singh"}, {"authorId": "34721166", "name": "Anna Rohrbach"}], "abstract": "Training a referring expression comprehension (ReC) model for a new visual domain requires collecting referring expressions, and potentially corresponding bounding boxes, for images in the domain. While large-scale pre-trained models are useful for image classification across domains, it remains unclear if they can be applied in a zero-shot manner to more complex tasks like ReC. We present ReCLIP, a simple but strong zero-shot baseline that repurposes CLIP, a state-of-the-art large-scale model, for ReC. Motivated by the close connection between ReC and CLIP’s contrastive pre-training objective, the first component of ReCLIP is a region-scoring method that isolates object proposals via cropping and blurring, and passes them to CLIP. However, through controlled experiments on a synthetic dataset, we find that CLIP is largely incapable of performing spatial reasoning off-the-shelf. We reduce the gap between zero-shot baselines from prior work and supervised models by as much as 29% on RefCOCOg, and on RefGTA (video game imagery), ReCLIP’s relative improvement over supervised ReC models trained on real images is 8%.", "corpusId": "248118561"}
{"paperId": "67262b3ae544f51f7480650b064a740816e194c9", "title": "ReCoSa: Detecting the Relevant Contexts with Self-Attention for Multi-turn Dialogue Generation", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2019, "citationCount": 124, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P19-1362.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1907.05339, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-09", "authors": [{"authorId": "2108769177", "name": "Hainan Zhang"}, {"authorId": "37510256", "name": "Yanyan Lan"}, {"authorId": "48537499", "name": "Liang Pang"}, {"authorId": "1777025", "name": "J. Guo"}, {"authorId": "1717004", "name": "Xueqi Cheng"}], "abstract": "In multi-turn dialogue generation, response is usually related with only a few contexts. Therefore, an ideal model should be able to detect these relevant contexts and produce a suitable response accordingly. However, the widely used hierarchical recurrent encoder-decoder models just treat all the contexts indiscriminately, which may hurt the following response generation process. Some researchers try to use the cosine similarity or the traditional attention mechanism to find the relevant contexts, but they suffer from either insufficient relevance assumption or position bias problem. In this paper, we propose a new model, named ReCoSa, to tackle this problem. Firstly, a word level LSTM encoder is conducted to obtain the initial representation of each context. Then, the self-attention mechanism is utilized to update both the context and masked response representation. Finally, the attention weights between each context and response representations are computed and used in the further decoding process. Experimental results on both Chinese customer services dataset and English Ubuntu dialogue dataset show that ReCoSa significantly outperforms baseline models, in terms of both metric-based and human evaluations. Further analysis on attention shows that the detected relevant contexts by ReCoSa are highly coherent with human’s understanding, validating the correctness and interpretability of ReCoSa.", "corpusId": "195886246"}
{"paperId": "f9db21c20fc1d6d096be5c707c31387da693c611", "title": "Synchronous Double-channel Recurrent Network for Aspect-Opinion Pair Extraction", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2020, "citationCount": 133, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.acl-main.582.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2020.acl-main.582, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "authors": [{"authorId": "2118433851", "name": "Shaowei Chen"}, {"authorId": "2146652835", "name": "Jie Liu"}, {"authorId": "2153604803", "name": "Yu Wang"}, {"authorId": null, "name": "Wenzheng Zhang"}, {"authorId": "83365410", "name": "Ziming Chi"}], "abstract": "Opinion entity extraction is a fundamental task in fine-grained opinion mining. Related studies generally extract aspects and/or opinion expressions without recognizing the relations between them. However, the relations are crucial for downstream tasks, including sentiment classification, opinion summarization, etc. In this paper, we explore Aspect-Opinion Pair Extraction (AOPE) task, which aims at extracting aspects and opinion expressions in pairs. To deal with this task, we propose Synchronous Double-channel Recurrent Network (SDRN) mainly consisting of an opinion entity extraction unit, a relation detection unit, and a synchronization unit. The opinion entity extraction unit and the relation detection unit are developed as two channels to extract opinion entities and relations simultaneously. Furthermore, within the synchronization unit, we design Entity Synchronization Mechanism (ESM) and Relation Synchronization Mechanism (RSM) to enhance the mutual benefit on the above two channels. To verify the performance of SDRN, we manually build three datasets based on SemEval 2014 and 2015 benchmarks. Extensive experiments demonstrate that SDRN achieves state-of-the-art performances.", "corpusId": "220047070"}
{"paperId": "d3bd93b8fb79290a803d00fe32c30e53fbcff6de", "title": "Exploring Distantly-Labeled Rationales in Neural Network Models", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2021, "citationCount": 10, "openAccessPdf": {"url": "https://aclanthology.org/2021.acl-long.433.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2106.01809, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-03", "authors": [{"authorId": "2007771781", "name": "Quzhe Huang"}, {"authorId": "2110041566", "name": "Shengqi Zhu"}, {"authorId": "2115387922", "name": "Yansong Feng"}, {"authorId": "9072379", "name": "Dongyan Zhao"}], "abstract": "Recent studies strive to incorporate various human rationales into neural networks to improve model performance, but few pay attention to the quality of the rationales. Most existing methods distribute their models’ focus to distantly-labeled rationale words entirely and equally, while ignoring the potential important non-rationale words and not distinguishing the importance of different rationale words. In this paper, we propose two novel auxiliary loss functions to make better use of distantly-labeled rationales, which encourage models to maintain their focus on important words beyond labeled rationales (PINs) and alleviate redundant training on non-helpful rationales (NoIRs). Experiments on two representative classification tasks show that our proposed methods can push a classification model to effectively learn crucial clues from non-perfect rationales while maintaining the ability to spread its focus to other unlabeled important words, thus significantly outperform existing methods.", "corpusId": "235313693"}
{"paperId": "ee3baa90e67135921f19331c2c2c1369c8242dd2", "title": "Direct Finger Manipulation of 3D Object Image with Ultrasound Haptic Feedback", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 34, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3290605.3300317", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300317?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300317, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-05-02", "authors": [{"authorId": "27234661", "name": "Atsushi Matsubayashi"}, {"authorId": "1712395", "name": "Yasutoshi Makino"}, {"authorId": "1715925", "name": "Hiroyuki Shinoda"}], "abstract": "In this study, we prototype and examine a system that allows a user to manipulate a 3D virtual object with multiple fingers without wearing any device. An autostereoscopic display produces a 3D image and a depth sensor measures the movement of the fingers. When a user touches a virtual object, haptic feedback is provided by ultrasound phased arrays. By estimating the cross section of the finger in contact with the virtual object and by creating a force pattern around it, it is possible for the user to recognize the position of the surface relative to the finger. To evaluate our system, we conducted two experiments to show that the proposed feedback method is effective in recognizing the object surface and thereby enables the user to grasp the object quickly without seeing it.", "corpusId": "140213435"}
{"paperId": "acb5e45732d76ef69b709a8eec21aa0ebae9c804", "title": "AM2iCo: Evaluating Word Meaning in Context across Low-Resource Languages with Adversarial Examples", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 20, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.571.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2104.08639, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-17", "authors": [{"authorId": "2145484051", "name": "Qianchu Liu"}, {"authorId": "3381663", "name": "E. Ponti"}, {"authorId": "145586618", "name": "Diana McCarthy"}, {"authorId": "1747849", "name": "Ivan Vulic"}, {"authorId": "145762466", "name": "A. Korhonen"}], "abstract": "Capturing word meaning in context and distinguishing between correspondences and variations across languages is key to building successful multilingual and cross-lingual text representation models. However, existing multilingual evaluation datasets that evaluate lexical semantics “in-context” have various limitations. In particular, 1) their language coverage is restricted to high-resource languages and skewed in favor of only a few language families and areas, 2) a design that makes the task solvable via superficial cues, which results in artificially inflated (and sometimes super-human) performances of pretrained encoders, and 3) no support for cross-lingual evaluation. In order to address these gaps, we present AM2iCo (Adversarial and Multilingual Meaning in Context), a wide-coverage cross-lingual and multilingual evaluation set; it aims to faithfully assess the ability of state-of-the-art (SotA) representation models to understand the identity of word meaning in cross-lingual contexts for 14 language pairs. We conduct a series of experiments in a wide range of setups and demonstrate the challenging nature of AM2iCo. The results reveal that current SotA pretrained encoders substantially lag behind human performance, and the largest gaps are observed for low-resource languages and languages dissimilar to English.", "corpusId": "233296035"}
{"paperId": "1aba2e7139161fc277e54265e8543539b3c2ca75", "title": "Deep Neural Model Inspection and Comparison via Functional Neuron Pathways", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2019, "citationCount": 12, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P19-1575.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/P19-1575, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "authors": [{"authorId": "2366489566", "name": "James Fiacco"}, {"authorId": "22177625", "name": "Samridhi Choudhary"}, {"authorId": "35959897", "name": "C. Rosé"}], "abstract": "We introduce a general method for the interpretation and comparison of neural models. The method is used to factor a complex neural model into its functional components, which are comprised of sets of co-firing neurons that cut across layers of the network architecture, and which we call neural pathways. The function of these pathways can be understood by identifying correlated task level and linguistic heuristics in such a way that this knowledge acts as a lens for approximating what the network has learned to apply to its intended task. As a case study for investigating the utility of these pathways, we present an examination of pathways identified in models trained for two standard tasks, namely Named Entity Recognition and Recognizing Textual Entailment.", "corpusId": "196211427"}
{"paperId": "5191e04c378bf81812911210ebeca6ee44439b4d", "title": "Nailz: Sensing Hand Input with Touch Sensitive Nails", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 25, "openAccessPdf": {"url": "", "status": null, "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376778?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376778, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-04-21", "authors": [{"authorId": "2109455987", "name": "Doyoung Lee"}, {"authorId": "2108254106", "name": "S. Lee"}, {"authorId": "145902847", "name": "Ian Oakley"}], "abstract": "Touches between the fingers of an unencumbered hand represent a ready-to-use, eyes-free and expressive input space suitable for interacting with wearable devices such as smart glasses or watches. While prior work has focused on touches to the inner surface of the hand, touches to the nails, a practical site for mounting sensing hardware, have been comparatively overlooked. We extend prior implementations of single touch sensing nails to a full set of five and explore their potential for wearable input. We present design ideas and an input space of 144 touches (taps, flicks and swipes) derived from an ideation workshop. We complement this with data from two studies characterizing the subjective comfort and objective characteristics (task time, accuracy) of each touch. We conclude by synthesizing this material into a set of 29 viable nail touches, assessing their performance in a final study and illustrating how they could be used by presenting, and qualitatively evaluating, two example applications.", "corpusId": "218483478"}
{"paperId": "8fcff5229f4e115a16dc33daf40a87f8a427ba9e", "title": "RetroShape: Leveraging Rear-Surface Shape Displays for 2.5D Interaction on Smartwatches", "venue": "ACM Symposium on User Interface Software and Technology", "year": 2017, "citationCount": 28, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3126594.3126610?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3126594.3126610, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-10-20", "authors": [{"authorId": "3310020", "name": "Da-Yuan Huang"}, {"authorId": "2114008017", "name": "Ruizhen Guo"}, {"authorId": "1574549639", "name": "Jun Gong"}, {"authorId": "2110160883", "name": "Jingxian Wang"}, {"authorId": "2074472472", "name": "J. Graham"}, {"authorId": "1731140", "name": "De-Nian Yang"}, {"authorId": "1791070", "name": "Xing-Dong Yang"}], "abstract": null, "corpusId": "2323656"}
{"paperId": "c1d0e73ec3aaf7ffdcbe41835d649d638cbc2f2d", "title": "Consistent Accelerated Inference via Confident Adaptive Transformers", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 77, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.406.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2104.08803, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-18", "authors": [{"authorId": "32303439", "name": "Tal Schuster"}, {"authorId": "2064150446", "name": "Adam Fisch"}, {"authorId": "35132120", "name": "T. Jaakkola"}, {"authorId": "1741283", "name": "R. Barzilay"}], "abstract": "We develop a novel approach for confidently accelerating inference in the large and expensive multilayer Transformers that are now ubiquitous in natural language processing (NLP). Amortized or approximate computational methods increase efficiency, but can come with unpredictable performance costs. In this work, we present CATs – Confident Adaptive Transformers – in which we simultaneously increase computational efficiency, while guaranteeing a specifiable degree of consistency with the original model with high confidence. Our method trains additional prediction heads on top of intermediate layers, and dynamically decides when to stop allocating computational effort to each input using a meta consistency classifier. To calibrate our early prediction stopping rule, we formulate a unique extension of conformal prediction. We demonstrate the effectiveness of this approach on four classification and regression tasks.", "corpusId": "233296246"}
{"paperId": "6deed763603b2381045932b6706c9dd15b6a2ccc", "title": "CloakingNote: A Novel Desktop Interface for Subtle Writing Using Decoy Texts", "venue": "ACM Symposium on User Interface Software and Technology", "year": 2016, "citationCount": 6, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/2984511.2984571?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/2984511.2984571, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2016-10-16", "authors": [{"authorId": "1399263337", "name": "S. L’Yi"}, {"authorId": "1834207", "name": "Kyle Koh"}, {"authorId": "1939362", "name": "Jaemin Jo"}, {"authorId": "2713391", "name": "Bo Hyoung Kim"}, {"authorId": "2016076", "name": "Jinwook Seo"}], "abstract": null, "corpusId": "17706963"}
{"paperId": "0e131a325ffbdbfb8963ce8c63b1336376bf5de8", "title": "ConReader: Exploring Implicit Relations in Contracts for Contract Clause Extraction", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 8, "openAccessPdf": {"url": "http://arxiv.org/pdf/2210.08697", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2210.08697, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-17", "authors": [{"authorId": "37024864", "name": "Weiwen Xu"}, {"authorId": "145843537", "name": "Yang Deng"}, {"authorId": "39165620", "name": "Wenqiang Lei"}, {"authorId": null, "name": "Wenlong Zhao"}, {"authorId": "143779329", "name": "Tat-seng Chua"}, {"authorId": "1380007189", "name": "W. Lam"}], "abstract": "We study automatic Contract Clause Extraction (CCE) by modeling implicit relations in legal contracts. Existing CCE methods mostly treat contracts as plain text, creating a substantial barrier to understanding contracts of high complexity. In this work, we first comprehensively analyze the complexity issues of contracts and distill out three implicit relations commonly found in contracts, namely, 1) Long-range Context Relation that captures the correlations of distant clauses; 2) Term-Definition Relation that captures the relation between important terms with their corresponding definitions, and 3) Similar Clause Relation that captures the similarities between clauses of the same type. Then we propose a novel framework ConReader to exploit the above three relations for better contract understanding and improving CCE. Experimental results show that ConReader makes the prediction more interpretable and achieves new state-of-the-art on two CCE tasks in both conventional and zero-shot settings.", "corpusId": "252918771"}
{"paperId": "4b85febcc238644d220bc909f521eeec80288f48", "title": "Tag a Teacher: A Qualitative Analysis of WhatsApp-Based Teacher Networks in Low-Income Indian Schools", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 20, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3411764.3445221?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3411764.3445221, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-05-06", "authors": [{"authorId": "20611041", "name": "R. Varanasi"}, {"authorId": "1687200", "name": "Aditya Vashistha"}, {"authorId": "2875293", "name": "Nicola Dell"}], "abstract": "Although WhatsApp-based communication is playing an increasingly large role in the professional lives of teachers in low-income schools, the nature of the interactions that occur and how these interactions enable cooperative work are not well understood. We contribute a qualitative analysis of 26 existing WhatsApp groups (35,567 messages) that examines (1) the strategies used to encourage interaction within teacher-focused WhatsApp groups, and (2) how these interactions are sustained by teachers, management, and organizations over a period of time. We use teacher networks and activity awareness model to make sense of WhatsApp-based interactions and show how WhatsApp narrows the gap between management and teachers, leading to additional work and stress for teachers. WhatsApp was also used to circulate polarizing and malicious information, leading to a variety of interesting content moderation strategies. Our findings expand the scope of research on teacher networks to low-income contexts and will inform future interventions that enable cooperative work among teachers.", "corpusId": "233987587"}
{"paperId": "89a39a205f41afd5f4078fe0e753ee9d5c673797", "title": "Subcontracting Microwork", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 29, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3025687?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3025687, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "144844426", "name": "M. Morris"}, {"authorId": "1744846", "name": "Jeffrey P. Bigham"}, {"authorId": "145664318", "name": "Robin N. Brewer"}, {"authorId": "2699105", "name": "Jonathan Bragg"}, {"authorId": "144686521", "name": "A. Kulkarni"}, {"authorId": "2109008853", "name": "Jessie Li"}, {"authorId": "1983163", "name": "Saiph Savage"}], "abstract": null, "corpusId": "12217908"}
{"paperId": "fc6d17417e0760d3843aad75c63256140d2a139e", "title": "Characterizing Finger Pitch and Roll Orientation During Atomic Touch Actions", "venue": "International Conference on Human Factors in Computing Systems", "year": 2018, "citationCount": 14, "openAccessPdf": {"url": "https://hal.archives-ouvertes.fr/hal-01714827/file/fingerOrientation.pdf", "status": "GREEN", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3173574.3174163?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3173574.3174163, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-04-21", "authors": [{"authorId": "2647823", "name": "Alix Goguey"}, {"authorId": "3051289", "name": "Géry Casiez"}, {"authorId": "145731603", "name": "Daniel Vogel"}, {"authorId": "1693768", "name": "C. Gutwin"}], "abstract": null, "corpusId": "5046373"}
{"paperId": "b98b11669a0800b908fd919b824daa9a01ae5c0e", "title": "PlanHelper", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "citationCount": 8, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3555555?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3555555, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-07", "authors": [{"authorId": "2156639193", "name": "Chengzhong Liu"}, {"authorId": "2109583210", "name": "Zeyu Huang"}, {"authorId": "15936628", "name": "Dingdong Liu"}, {"authorId": "2170064600", "name": "Shixu Zhou"}, {"authorId": "2087005016", "name": "Zhenhui Peng"}, {"authorId": "2149143741", "name": "Xiaojuan Ma"}], "abstract": "Community-based Question Answering (CQA) platforms can provide rich experience and suggestions for people who seek to construct Activity Plans (AP), such as bodybuilding or sightseeing. However, answer posts in CQA platforms could be too unstructured and overwhelming to be easily applied to AP construction, as validated by our formative study for understanding relevant user challenges. We therefore proposed an answer-post processing pipeline, based on which we built PlanHelper, a tool assisting users in processing the CQA information and constructing AP interactively. We conducted a within-subject study (N=24) with a Quora-like interface as the baseline. Results suggested that when creating AP with PlanHelper, users were significantly more satisfied with the informational support and more engaged during the interaction. Moreover, we performed an in-depth analysis on the user behaviors with PlanHelper and summarized the design considerations for such supporting tools.", "corpusId": "253461004"}
{"paperId": "6a2daefcae320eece9aa56cb8cb6c55503c59eb2", "title": "Morphological Irregularity Correlates with Frequency", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2019, "citationCount": 22, "openAccessPdf": {"url": "http://arxiv.org/pdf/1906.11483", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1906.11483, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-06-27", "authors": [{"authorId": "50425845", "name": "Shijie Wu"}, {"authorId": "1750769", "name": "Ryan Cotterell"}, {"authorId": "11030219", "name": "Timothy J. O'Donnell"}], "abstract": "We present a study of morphological irregularity. Following recent work, we define an information-theoretic measure of irregularity based on the predictability of forms in a language. Using a neural transduction model, we estimate this quantity for the forms in 28 languages. We first present several validatory and exploratory analyses of irregularity. We then show that our analyses provide evidence for a correlation between irregularity and frequency: higher frequency items are more likely to be irregular and irregular items are more likely be highly frequent. To our knowledge, this result is the first of its breadth and confirms longstanding proposals from the linguistics literature. The correlation is more robust when aggregated at the level of whole paradigms—providing support for models of linguistic structure in which inflected forms are unified by abstract underlying stems or lexemes.", "corpusId": "195699929"}
{"paperId": "d1c17ece276a77cb1e4cdead262d23ce071a6cb2", "title": "Language-Agnostic Meta-Learning for Low-Resource Text-to-Speech with Articulatory Features", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "citationCount": 33, "openAccessPdf": {"url": "http://arxiv.org/pdf/2203.03191", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2203.03191, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-07", "authors": [{"authorId": "1672834397", "name": "Florian Lux"}, {"authorId": "4160376", "name": "Ngoc Thang Vu"}], "abstract": "While neural text-to-speech systems perform remarkably well in high-resource scenarios, they cannot be applied to the majority of the over 6,000 spoken languages in the world due to a lack of appropriate training data. In this work, we use embeddings derived from articulatory vectors rather than embeddings derived from phoneme identities to learn phoneme representations that hold across languages. In conjunction with language agnostic meta learning, this enables us to fine-tune a high-quality text-to-speech model on just 30 minutes of data in a previously unseen language spoken by a previously unseen speaker.", "corpusId": "247292155"}
{"paperId": "8350f6e01b22cd6ba85450f52572a022543e0f53", "title": "Instance Regularization for Discriminative Language Model Pre-training", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 2, "openAccessPdf": {"url": "http://arxiv.org/pdf/2210.05471", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2210.05471, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-11", "authors": [{"authorId": "3322871", "name": "Zhuosheng Zhang"}, {"authorId": "2146232510", "name": "Hai Zhao"}, {"authorId": "143849609", "name": "M. Zhou"}], "abstract": "Discriminative pre-trained language models (PrLMs) can be generalized as denoising auto-encoders that work with two procedures, ennoising and denoising. First, an ennoising process corrupts texts with arbitrary noising functions to construct training instances. Then, a denoising language model is trained to restore the corrupted tokens. Existing studies have made progress by optimizing independent strategies of either ennoising or denosing. They treat training instances equally throughout the training process, with little attention on the individual contribution of those instances. To model explicit signals of instance contribution, this work proposes to estimate the complexity of restoring the original sentences from corrupted ones in language model pre-training. The estimations involve the corruption degree in the ennoising data construction process and the prediction confidence in the denoising counterpart. Experimental results on natural language understanding and reading comprehension benchmarks show that our approach improves pre-training efficiency, effectiveness, and robustness. Code is publicly available at https://github.com/cooelf/InstanceReg.", "corpusId": "252815455"}
{"paperId": "71c72854f61fbd6ef8cb71dbea47ba8ea4d9c8a4", "title": "MPII: Multi-Level Mutual Promotion for Inference and Interpretation", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "citationCount": 7, "openAccessPdf": {"url": "https://aclanthology.org/2022.acl-long.488.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2022.acl-long.488, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "1679704", "name": "Y. Liu"}, {"authorId": "2107970655", "name": "Sanyuan Chen"}, {"authorId": "2368668741", "name": "Yazheng Yang"}, {"authorId": "152464732", "name": "Qi Dai"}], "abstract": "In order to better understand the rationale behind model behavior, recent works have exploited providing interpretation to support the inference prediction. However, existing methods tend to provide human-unfriendly interpretation, and are prone to sub-optimal performance due to one-side promotion, i.e. either inference promotion with interpretation or vice versa. In this paper, we propose a multi-level Mutual Promotion mechanism for self-evolved Inference and sentence-level Interpretation (MPII). Specifically, from the model-level, we propose a Step-wise Integration Mechanism to jointly perform and deeply integrate inference and interpretation in an autoregressive manner. From the optimization-level, we propose an Adversarial Fidelity Regularization to improve the fidelity between inference and interpretation with the Adversarial Mutual Information training strategy. Extensive experiments on NLI and CQA tasks reveal that the proposed MPII approach can significantly outperform baseline models for both the inference performance and the interpretation quality.", "corpusId": "248780027"}
{"paperId": "a6d09cdcb9c6760c2c670f0c962d4693e55a2874", "title": "Translationese as a Language in “Multilingual” NMT", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2019, "citationCount": 49, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.acl-main.691.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1911.03823, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-11-10", "authors": [{"authorId": "47718053", "name": "Parker Riley"}, {"authorId": "73769795", "name": "Isaac Caswell"}, {"authorId": "35307070", "name": "Markus Freitag"}, {"authorId": "2529182", "name": "David Grangier"}], "abstract": "Machine translation has an undesirable propensity to produce “translationese” artifacts, which can lead to higher BLEU scores while being liked less by human raters. Motivated by this, we model translationese and original (i.e. natural) text as separate languages in a multilingual model, and pose the question: can we perform zero-shot translation between original source text and original target text? There is no data with original source and original target, so we train a sentence-level classifier to distinguish translationese from original target text, and use this classifier to tag the training data for an NMT model. Using this technique we bias the model to produce more natural outputs at test time, yielding gains in human evaluation scores on both accuracy and fluency. Additionally, we demonstrate that it is possible to bias the model to produce translationese and game the BLEU score, increasing it while decreasing human-rated quality. We analyze these outputs using metrics measuring the degree of translationese, and present an analysis of the volatility of heuristic-based train-data tagging.", "corpusId": "207852344"}
{"paperId": "6f5ec67b30ab79e1e3b1fa656c53972738521f73", "title": "WallTokens: Surface Tangibles for Vertical Displays", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 7, "openAccessPdf": {"url": "https://hal.archives-ouvertes.fr/hal-03122016/file/main-hal.pdf", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3411764.3445404?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3411764.3445404, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-05-06", "authors": [{"authorId": "2087426052", "name": "Emmanuel Courtoux"}, {"authorId": "1802574", "name": "Caroline Appert"}, {"authorId": "3342979", "name": "O. Chapuis"}], "abstract": "Tangibles can enrich interaction with digital surfaces. Among others, they support eyes-free control or increase awareness of other users’ actions. Tangibles have been studied in combination with horizontal surfaces such as tabletops, but not with vertical screens such as wall displays. The obvious obstacle is gravity: tangibles cannot be placed on such surfaces without falling. We present WallTokens, easy-to-fabricate tangibles to interact with a vertical surface. A WallToken is a passive token whose footprint is recognized on a tactile surface. It is equipped with a push-handle that controls a suction cup. This makes it easy for users to switch between sliding the token or attaching it to the wall. We describe how to build such tokens and how to recognize them on a tactile surface. We report on a study showing the benefits of WallTokens for manipulating virtual objects over multi-touch gestures. This project is a step towards enabling tangible interaction in a wall display context.", "corpusId": "233556626"}
{"paperId": "554915a6eac034f093512469153e21ae15c3a4e7", "title": "Let's Play Together: Adaptation Guidelines of Board Games for Players with Visual Impairment", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 34, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300861?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300861, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-05-02", "authors": [{"authorId": "3306879", "name": "Frederico Da Rocha Tomé Filho"}, {"authorId": "1403123109", "name": "Pejman Mirza-Babaei"}, {"authorId": "1796298", "name": "B. Kapralos"}, {"authorId": "104198983", "name": "G. M. Junior"}], "abstract": "Board games present accessibility barriers for players with visual impairment since they often employ visuals alone to communicate gameplay information. Our research focuses on board game accessibility for those with visual impairment. This paper describes a three-phase study conducted to develop board game accessibility adaptation guidelines. These guidelines were developed through a user-centered design approach that included in-depth interviews and a series of user studies using two adapted board games. Our findings indicate that participants with and without visual impairment were able to play the adapted games, exhibiting a balanced experience whereby participants had complete autonomy and were provided with equal chances of victory. Our paper also contributes to the game and accessibility communities through the development of adaptation guidelines that allow board games to become inclusive irrespective of a player's visual impairment.", "corpusId": "140319064"}
{"paperId": "afc8c80b232934dc9232c57582914581a95fe388", "title": "Multimodal Routing: Improving Local and Global Interpretability of Multimodal Language Analysis", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 94, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.emnlp-main.143.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2020.emnlp-main.143, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-29", "authors": [{"authorId": "145639633", "name": "Yao-Hung Hubert Tsai"}, {"authorId": "1384374825", "name": "Martin Q. Ma"}, {"authorId": "72966973", "name": "Muqiao Yang"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}, {"authorId": "49933077", "name": "Louis-philippe Morency"}], "abstract": "The human language can be expressed through multiple sources of information known as modalities, including tones of voice, facial gestures, and spoken language. Recent multimodal learning with strong performances on human-centric tasks such as sentiment analysis and emotion recognition are often black-box, with very limited interpretability. In this paper we propose Multimodal Routing, which dynamically adjusts weights between input modalities and output representations differently for each input sample. Multimodal routing can identify relative importance of both individual modalities and cross-modality features. Moreover, the weight assignment by routing allows us to interpret modality-prediction relationships not only globally (i.e. general trends over the whole dataset), but also locally for each single input sample, mean-while keeping competitive performance compared to state-of-the-art methods.", "corpusId": "222163890"}
{"paperId": "81489890d86db6c14e438682a0bcffaafcc12aba", "title": "Older People Inventing their Personal Internet of Things with the IoT Un-Kit Experience", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 56, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300552?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300552, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-05-02", "authors": [{"authorId": "3390106", "name": "Aloha May Hufana Ambe"}, {"authorId": "1720522", "name": "M. Brereton"}, {"authorId": "2181723", "name": "A. Soro"}, {"authorId": "47078378", "name": "M. Chai"}, {"authorId": "2429549", "name": "L. Buys"}, {"authorId": "145133480", "name": "P. Roe"}], "abstract": "We introduce the IoT Un-Kit Experience, a co-design approach that engages people in exploring, designing and generating personally meaningful IoT applications and that also serves as a means to explore IoT kit design through in-home workshops. Un-Kit represents a seemingly uncompleted set of sensors, actuators and media elements that have a decontextualized appearance - unfinished state, undefined purpose and unboxed form. The approach emphasises users contemplating and experiencing the IoT elements in their familiar space through detailed and layered conversation with researchers; rather than focusing on connecting up the kit itself, thus their ideas are not constrained by the kit or their competence with it. We illustrate the approach through in-home workshops with older adults, envisioned users of IoT who have had limited voice in its conception. The Un-kit approach supported participants to lead the process and to imagine new artfully integrated designs, with personally legible interactions and aesthetic qualities that fit their desire. We offer insights for a more situated and responsive approach to design of the IoT and its constituent kits.", "corpusId": "140220846"}
{"paperId": "b4482e8630639ac1ad05f47f9340d434eddf6bb1", "title": "Word Rotator’s Distance", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 62, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.emnlp-main.236.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2004.15003, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-30", "authors": [{"authorId": "32286159", "name": "Sho Yokoi"}, {"authorId": "2143210266", "name": "Ryo Takahashi"}, {"authorId": "31487889", "name": "Reina Akama"}, {"authorId": "153211541", "name": "Jun Suzuki"}, {"authorId": "3040648", "name": "Kentaro Inui"}], "abstract": "One key principle for assessing semantic similarity between texts is to measure the degree of semantic overlap of them by considering word-by-word alignment. However, alignment-based approaches} are inferior to the generic sentence vectors in terms of performance. We hypothesize that the reason for the inferiority of alignment-based methods is due to the fact that they do not distinguish word importance and word meaning. To solve this, we propose to separate word importance and word meaning by decomposing word vectors into their norm and direction, then compute the alignment-based similarity with the help of earth mover's distance. We call the method word rotator's distance (WRD) because direction vectors are aligned by rotation on the unit hypersphere. In addition, to incorporate the advance of cutting edge additive sentence encoders, we propose to re-decompose such sentence vectors into word vectors and use them as inputs to WRD. Empirically, the proposed method outperforms current methods considering the word-by-word alignment including word mover's distance with a big difference; moreover, our method outperforms state-of-the-art additive sentence encoders on the most competitive dataset, STS-benchmark.", "corpusId": "222205685"}
{"paperId": "abd9c62d1ee42365f3c9a8e4e25617f9b2e0785d", "title": "ReType: Quick Text Editing with Keyboard and Gaze", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 26, "openAccessPdf": {"url": "https://researchportal.bath.ac.uk/files/190368020/ReType_CHI2019.pdf", "status": "GREEN", "license": "other-oa", "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300433?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300433, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-05-02", "authors": [{"authorId": "113796643", "name": "Shyamli Sindhwani"}, {"authorId": "2990849", "name": "C. Lutteroth"}, {"authorId": "145207028", "name": "Gerald Weber"}], "abstract": "When a user needs to reposition the cursor during text editing, this is often done using the mouse. For experienced typists especially, the switch between keyboard and mouse can slow down the keyboard editing workflow considerably. To address this we propose ReType, a new gaze-assisted positioning technique combining keyboard with gaze input based on a new 'patching' metaphor. ReType allows users to perform some common editing operations while keeping their hands on the keyboard. We present the result of two studies. A free-use study indicated that ReType enhances the user experience of text editing. ReType was liked by many participants, regardless of their typing skills. A comparative user study showed that ReType is able to match or even beat the speed of mouse-based interaction for small text edits. We conclude that the gaze-augmented user interface can make common interactions more fluent, especially for professional keyboard users.", "corpusId": "140228598"}
{"paperId": "63a8da4fbbbfd85957c90599bbac730fd56ecd31", "title": "Class Confessions: Restorative Properties in Online Experiences of Socioeconomic Stigma", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 24, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3025921?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3025921, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "10741193", "name": "E. H. Rho"}, {"authorId": "2431050", "name": "Oliver L. Haimson"}, {"authorId": "2471896", "name": "Nazanin Andalibi"}, {"authorId": "145001661", "name": "Melissa Mazmanian"}, {"authorId": "144150258", "name": "Gillian R. Hayes"}], "abstract": null, "corpusId": "34313584"}
{"paperId": "8fc62b3860a6dfe24c2449572c56060b9a41d55f", "title": "Including the Experiences of Physically Disabled Players in Mainstream Guidelines for Movement-Based Games", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "citationCount": 9, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3491102.3501867", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3491102.3501867?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3491102.3501867, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2022-04-27", "authors": [{"authorId": "1666035407", "name": "Liam Mason"}, {"authorId": "1797251", "name": "K. Gerling"}, {"authorId": "1733041", "name": "P. Dickinson"}, {"authorId": "2546666", "name": "J. Holopainen"}, {"authorId": "119309295", "name": "Lisalyn R. Jacobs"}, {"authorId": "34153464", "name": "Kieran Hicks"}], "abstract": "Movement-based video games can provide engaging play experiences, and also have the potential to encourage physical activity. However, existing design guidelines for such games overwhelmingly focus on non-disabled players. Here, we explore wheelchair users’ perspectives on movement-based games as an enjoyable play activity. We created eight game concepts as discussion points for semi-structured interviews (N=6) with wheelchair users, and used Interpretative Phenomenological Analysis to understand their perspectives on physical activity and play. Themes focus on independent access, challenges in social settings, and the need for comprehensive adaptation. We also conducted an online survey (N=21) using the same game concepts, and thematic analysis highlighted the importance of adequate challenge, and considerations around multiplayer experiences. Based on these findings, we re-contextualize and expand guidelines for movement-based games previously established by Mueller and Isbister to include disabled players, and suggest design strategies that take into account their perspectives on play.", "corpusId": "248419999"}
{"paperId": "72e14f0cae1aafe77a2318df89b4fe15e5e7fc96", "title": "Staying the Course: System-Driven Lapse Management for Supporting Behavior Change", "venue": "International Conference on Human Factors in Computing Systems", "year": 2016, "citationCount": 44, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/2858036.2858142?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/2858036.2858142, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2016-05-07", "authors": [{"authorId": "2183447", "name": "Elena Agapie"}, {"authorId": "2667384", "name": "Daniel Avrahami"}, {"authorId": "144841404", "name": "Jennifer Marlow"}], "abstract": null, "corpusId": "5831963"}
{"paperId": "ea1438e2891853048c6383f234414fe43de793c7", "title": "Knowing About Knowing: An Illusion of Human Competence Can Hinder Appropriate Reliance on AI Systems", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "citationCount": 72, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3544548.3581025", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2301.11333, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2023-01-25", "authors": [{"authorId": "51149404", "name": "Gaole He"}, {"authorId": "147328480", "name": "L. Kuiper"}, {"authorId": "2516584", "name": "U. Gadiraju"}], "abstract": "The dazzling promises of AI systems to augment humans in various tasks hinge on whether humans can appropriately rely on them. Recent research has shown that appropriate reliance is the key to achieving complementary team performance in AI-assisted decision making. This paper addresses an under-explored problem of whether the Dunning-Kruger Effect (DKE) among people can hinder their appropriate reliance on AI systems. DKE is a metacognitive bias due to which less-competent individuals overestimate their own skill and performance. Through an empirical study (N = 249), we explored the impact of DKE on human reliance on an AI system, and whether such effects can be mitigated using a tutorial intervention that reveals the fallibility of AI advice, and exploiting logic units-based explanations to improve user understanding of AI advice. We found that participants who overestimate their performance tend to exhibit under-reliance on AI systems, which hinders optimal team performance. Logic units-based explanations did not help users in either improving the calibration of their competence or facilitating appropriate reliance. While the tutorial intervention was highly effective in helping users calibrate their self-assessment and facilitating appropriate reliance among participants with overestimated self-assessment, we found that it can potentially hurt the appropriate reliance of participants with underestimated self-assessment. Our work has broad implications on the design of methods to tackle user cognitive biases while facilitating appropriate reliance on AI systems. Our findings advance the current understanding of the role of self-assessment in shaping trust and reliance in human-AI decision making. This lays out promising future directions for relevant HCI research in this community.", "corpusId": "256358778"}
{"paperId": "21ea974bc645962f91d071984ea9c04ccf476c8e", "title": "CLUSE: Cross-Lingual Unsupervised Sense Embeddings", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2018, "citationCount": 6, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D18-1025.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1809.05694, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-15", "authors": [{"authorId": "27531332", "name": "Ta-Chung Chi"}, {"authorId": "1725643", "name": "Yun-Nung (Vivian) Chen"}], "abstract": "This paper proposes a modularized sense induction and representation learning model that jointly learns bilingual sense embeddings that align well in the vector space, where the cross-lingual signal in the English-Chinese parallel corpus is exploited to capture the collocation and distributed characteristics in the language pair. The model is evaluated on the Stanford Contextual Word Similarity (SCWS) dataset to ensure the quality of monolingual sense embeddings. In addition, we introduce Bilingual Contextual Word Similarity (BCWS), a large and high-quality dataset for evaluating cross-lingual sense embeddings, which is the first attempt of measuring whether the learned embeddings are indeed aligned well in the vector space. The proposed approach shows the superior quality of sense embeddings evaluated in both monolingual and bilingual spaces.", "corpusId": "52289318"}
{"paperId": "e1739af6e85bc57b43dc6b750b95912538cd1fef", "title": "MindCraft: Theory of Mind Modeling for Situated Dialogue in Collaborative Tasks", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 75, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.85.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2109.06275, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-13", "authors": [{"authorId": "89392298", "name": "Cristian-Paul Bara"}, {"authorId": "12782016", "name": "Sky CH-Wang"}, {"authorId": "1707259", "name": "J. Chai"}], "abstract": "An ideal integration of autonomous agents in a human world implies that they are able to collaborate on human terms. In particular, theory of mind plays an important role in maintaining common ground during human collaboration and communication. To enable theory of mind modeling in situated interactions, we introduce a fine-grained dataset of collaborative tasks performed by pairs of human subjects in the 3D virtual blocks world of Minecraft. It provides information that captures partners’ beliefs of the world and of each other as an interaction unfolds, bringing abundant opportunities to study human collaborative behaviors in situated language communication. As a first step towards our goal of developing embodied AI agents able to infer belief states of collaborative partners in situ, we build and present results on computational models for several theory of mind tasks.", "corpusId": "237502958"}
{"paperId": "1daf323d06fc68feba72d8826ea3372ef50aee14", "title": "“It’s Not Just Hate”: A Multi-Dimensional Perspective on Detecting Harmful Speech Online", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 17, "openAccessPdf": {"url": "https://arxiv.org/pdf/2210.15870", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2210.15870, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-28", "authors": [{"authorId": "49224924", "name": "Federico Bianchi"}, {"authorId": "1484164858", "name": "S. A. Hills"}, {"authorId": "21243375", "name": "Patrícia G. C. Rossini"}, {"authorId": "2022288", "name": "Dirk Hovy"}, {"authorId": "40944409", "name": "Rebekah Tromble"}, {"authorId": "1803171", "name": "N. Tintarev"}], "abstract": "Well-annotated data is a prerequisite for good Natural Language Processing models. Too often, though, annotation decisions are governed by optimizing time or annotator agreement. We make a case for nuanced efforts in an interdisciplinary setting for annotating offensive online speech. Detecting offensive content is rapidly becoming one of the most important real-world NLP tasks. However, most datasets use a single binary label, e.g., for hate or incivility, even though each concept is multi-faceted. This modeling choice severely limits nuanced insights, but also performance.We show that a more fine-grained multi-label approach to predicting incivility and hateful or intolerant content addresses both conceptual and performance issues.We release a novel dataset of over 40,000 tweets about immigration from the US and UK, annotated with six labels for different aspects of incivility and intolerance.Our dataset not only allows for a more nuanced understanding of harmful speech online, models trained on it also outperform or match performance on benchmark datasets", "corpusId": "253224282"}
{"paperId": "914ae489ca0c34c354da98379dba2c9005a1b83e", "title": "Brainsourcing: Crowdsourcing Recognition Tasks via Collaborative Brain-Computer Interfacing", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 17, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376288?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376288, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-04-21", "authors": [{"authorId": "2107086284", "name": "Keith M. Davis"}, {"authorId": "151091693", "name": "Lauri Kangassalo"}, {"authorId": "2353675", "name": "Michiel M. A. Spapé"}, {"authorId": "2084101", "name": "Tuukka Ruotsalo"}], "abstract": "This paper introduces brainsourcing: utilizing brain responses of a group of human contributors each performing a recognition task to determine classes of stimuli. We investigate to what extent it is possible to infer reliable class labels using data collected utilizing electroencephalography (EEG) from participants given a set of common stimuli. An experiment (N=30) measuring EEG responses to visual features of faces (gender, hair color, age, smile) revealed an improved F1 score of 0.94 for a crowd of twelve participants compared to an F1 score of 0.67 derived from individual participants and a random chance of 0.50. Our results demonstrate the methodological and pragmatic feasibility of brainsourcing in labeling tasks and opens avenues for more general applications using brain-computer interfacing in a crowdsourced setting.", "corpusId": "218483005"}
{"paperId": "ac8d24bf8b32dc2e8e35d46ae66a88b1604195c9", "title": "KirigamiTable: Designing for Proxemic Transitions with a Shape-Changing Tabletop", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 40, "openAccessPdf": {"url": "https://pure.au.dk/portal/files/178417199/KirigamiTable_CR_final.pdf", "status": "GREEN", "license": "other-oa", "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376834?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376834, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2020-04-21", "authors": [{"authorId": "1404543550", "name": "Jens Emil Sloth Grønbæk"}, {"authorId": "34653622", "name": "Majken Kirkegaard Rasmussen"}, {"authorId": "7918941", "name": "Kim Halskov"}, {"authorId": "1844730", "name": "M. G. Petersen"}], "abstract": "A core challenge in tabletop research is to support transitions between individual activities and team work. Shape-changing tabletops open up new opportunities for addressing this challenge. However, interaction design for shape-changing furniture is in its early stages - so far, research has mainly focused on triggering shape-changes, and less on the actual interface transitions. We present KirigamiTable - a novel actuated shape-changing tabletop for supporting transitions in collaborative work. Our work builds on the concept of Proxemic Transitions, considering the dynamic interplay between social interactions, interactive technologies and furniture. With KirigamiTable, we demonstrate the potential of interactions for proxemic transitions that combine transformation of shape and digital contents. We highlight challenges for shape-changing tabletops: initiating shape and content transformations, cooperative control, and anticipating shape-change. To address these challenges, we propose a set of novel interaction techniques, including shape-first and content-first interaction, cooperative gestures, and physical and digital preview of shape-changes.", "corpusId": "212711655"}
{"paperId": "85bc3c3707e514430ed29dfedc454d5f77630f46", "title": "Capturing Relations between Scientific Papers: An Abstractive Model for Related Work Section Generation", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2021, "citationCount": 60, "openAccessPdf": {"url": "https://aclanthology.org/2021.acl-long.473.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2021.acl-long.473, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": null, "authors": [{"authorId": "2116950235", "name": "Xiuying Chen"}, {"authorId": "1753416672", "name": "Hind Alamro"}, {"authorId": "9255404", "name": "Li Mingzhe"}, {"authorId": "2112311595", "name": "Shen Gao"}, {"authorId": "2928371", "name": "Xiangliang Zhang"}, {"authorId": "144060462", "name": "Dongyan Zhao"}, {"authorId": "144539156", "name": "Rui Yan"}], "abstract": "Given a set of related publications, related work section generation aims to provide researchers with an overview of the specific research area by summarizing these works and introducing them in a logical order. Most of existing related work generation models follow the inflexible extractive style, which directly extract sentences from multiple original papers to form a related work discussion. Hence, in this paper, we propose a Relation-aware Related work Generator (RRG), which generates an abstractive related work from the given multiple scientific papers in the same research area. Concretely, we propose a relation-aware multi-document encoder that relates one document to another according to their content dependency in a relation graph. The relation graph and the document representation are interacted and polished iteratively, complementing each other in the training process. We also contribute two public datasets composed of related work sections and their corresponding papers. Extensive experiments on the two datasets show that the proposed model brings substantial improvements over several strong baselines. We hope that this work will promote advances in related work generation task.", "corpusId": "236460044"}
{"paperId": "9893e9beec96c14f99ed0e06b0a189e11f0bbdcb", "title": "Synthesizing Stroke Gestures Across User Populations: A Case for Users with Visual Impairments", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 26, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3025906?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3025906, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "145800450", "name": "Luis A. Leiva"}, {"authorId": "1403846047", "name": "Daniel Martín-Albo"}, {"authorId": "1794666", "name": "Radu-Daniel Vatavu"}], "abstract": null, "corpusId": "33315489"}
{"paperId": "c511651253b71ce0f8d47e75e55d34f2f8ddbb89", "title": "A Conversation Analysis of Non-Progress and Coping Strategies with a Banking Task-Oriented Chatbot", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 63, "openAccessPdf": {"url": "", "status": null, "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376209?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376209, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-04-21", "authors": [{"authorId": "1391213671", "name": "Chi-Hsun Li"}, {"authorId": "1664945307", "name": "S. Yeh"}, {"authorId": "1666727061", "name": "Tang-Jie Chang"}, {"authorId": "2069880116", "name": "Meng-Hsuan Tsai"}, {"authorId": "2152953751", "name": "Ken Chen"}, {"authorId": "1684289", "name": "Yung-Ju Chang"}], "abstract": "Task-oriented chatbots are becoming popular alternatives for fulfilling users' needs, but few studies have investigated how users cope with conversational 'non-progress' (NP) in their daily lives. Accordingly, we analyzed a three-month conversation log between 1,685 users and a task-oriented banking chatbot. In this data, we observed 12 types of conversational NP; five types of content that was unexpected and challenging for the chatbot to recognize; and 10 types of coping strategies. Moreover, we identified specific relationships between NP types and strategies, as well as signs that users were about to abandon the chatbot, including 1) three consecutive incidences of NP, 2) consecutive use of message reformulation or switching subjects, and 3) using message reformulation as the final strategy. Based on these findings, we provide design recommendations for task-oriented chatbots, aimed at reducing NP, guiding users through such NP, and improving user experiences to reduce the cessation of chatbot use.", "corpusId": "218483474"}
{"paperId": "f33314c711903e8da6ddd5420d68bf313aac1fca", "title": "Home-Life and Work Rhythm Diversity in Distributed Teamwork: A Study with Information Workers during the COVID-19 Pandemic", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "citationCount": 20, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3512942", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3512942?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3512942, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-30", "authors": [{"authorId": "114416520", "name": "Thomas Breideband"}, {"authorId": "2207677", "name": "P. Sukumar"}, {"authorId": "143750317", "name": "G. Mark"}, {"authorId": "2040276359", "name": "Megan Caruso"}, {"authorId": "1410321367", "name": "Sidney K. D’Mello"}, {"authorId": "144244615", "name": "A. Striegel"}], "abstract": "During the COVID-19 pandemic, millions of previously co-located information workers had to work from home, a trend expected to become much more commonplace in the future. We interviewed 53 information workers from 17 U.S. teams to understand how this unique extended work-from-home setting influenced teamwork and how they adapted to it. Using a grounded theory approach, we discovered that extended remote work highlighted diversity in team members' home-lives and daily work rhythms. Whereas these types of diversity played only marginal roles for teams in the co-located office, they had a more tangible impact in the work-from-home setting, from coordination delays and interruptions to conflicts related to workload fairness, miscommunication, and trust. Importantly, workers reported that their teams adapted to these challenges by setting explicit norms and standards for online communication and asynchronous collaboration and by promoting general social and situational awareness. We discuss computer-supported designs to help teams manage these latent diversities in an extended remote teamwork setting.", "corpusId": "248002705"}
{"paperId": "ec0c590c87be8550b6637e2c5caf5506aa71b589", "title": "Target-Side Context for Discriminative Models in Statistical Machine Translation", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2016, "citationCount": 15, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/P16-1161.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1607.01149, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-04-04", "authors": [{"authorId": "2211536", "name": "Ales Tamchyna"}, {"authorId": "2277248", "name": "Alexander M. Fraser"}, {"authorId": "143832874", "name": "Ondrej Bojar"}, {"authorId": "1733933", "name": "Marcin Junczys-Dowmunt"}], "abstract": "Discriminative translation models utilizing source context have been shown to help statistical machine translation performance. We propose a novel extension of this work using target context information. Surprisingly, we show that this model can be efficiently integrated directly in the decoding process. Our approach scales to large training data sizes and results in consistent improvements in translation quality on four language pairs. We also provide an analysis comparing the strengths of the baseline source-context model with our extended source-context and target-context model and we show that our extension allows us to better capture morphological coherence. Our work is freely available as part of Moses.", "corpusId": "86111"}
{"paperId": "567e442a3cda22ef200e9da8f82a0c95d641a91d", "title": "Towards Participatory Video 2.0", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 17, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3313831.3376694", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376694?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376694, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-04-21", "authors": [{"authorId": "22699782", "name": "Delvin Varghese"}, {"authorId": "145171812", "name": "P. Olivier"}, {"authorId": "3132347", "name": "Tom Bartindale"}], "abstract": "Participatory video (PV) is an established practice for enabling communities to \"speak truth to power\" and has been widely used by local, national and international Non-Governmental Organizations (NGOs). However, the digital media landscape has changed dramatically since PV became widely accessible with the rise of the camcorder in the 1980s. Current media practices have evolved considerably since, yet PV remains essentially unchanged. We report on an investigation of current PV practices and reflect on these in terms of what the future for PV holds. We conducted interviews with staff at a global humanitarian network who directly and indirectly engage in community story capture; and explore their reflections on the potentials and barriers to PV use. We propose a new vision for PV that draws on current visual media production, consumption and distribution technologies and practices, and propose principles on which PV 2.0, a new generation of Participatory Video can be founded.", "corpusId": "218483102"}
{"paperId": "189596813a51c99f6ab9c8589103782c4f8807f0", "title": "Unsupervised Extractive Summarization-Based Representations for Accurate and Explainable Collaborative Filtering", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2021, "citationCount": 27, "openAccessPdf": {"url": "https://aclanthology.org/2021.acl-long.232.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2021.acl-long.232, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "3436048", "name": "R. A. Pugoy"}, {"authorId": "1738550", "name": "Hung-Yu kao"}], "abstract": "We pioneer the first extractive summarization-based collaborative filtering model called ESCOFILT. Our proposed model specifically produces extractive summaries for each item and user. Unlike other types of explanations, summary-level explanations closely resemble real-life explanations. The strength of ESCOFILT lies in the fact that it unifies representation and explanation. In other words, extractive summaries both represent and explain the items and users. Our model uniquely integrates BERT, K-Means embedding clustering, and multilayer perceptron to learn sentence embeddings, representation-explanations, and user-item interactions, respectively. We argue that our approach enhances both rating prediction accuracy and user/item explainability. Our experiments illustrate that ESCOFILT’s prediction accuracy is better than the other state-of-the-art recommender models. Furthermore, we propose a comprehensive set of criteria that assesses the real-life explainability of explanations. Our explainability study demonstrates the superiority of and preference for summary-level explanations over other explanation types.", "corpusId": "236460094"}
{"paperId": "d04677ae74143a793a3946b6a80576c4653e2e53", "title": "SentBS: Sentence-level Beam Search for Controllable Summarization", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 11, "openAccessPdf": {"url": "http://arxiv.org/pdf/2210.14502", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2210.14502, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-26", "authors": [{"authorId": "2152867918", "name": "Chenhui Shen"}, {"authorId": "123962152", "name": "Liying Cheng"}, {"authorId": "1996394", "name": "Lidong Bing"}, {"authorId": "2147330214", "name": "Yang You"}, {"authorId": "2059080424", "name": "Luo Si"}], "abstract": "A wide range of control perspectives have been explored in controllable text generation. Structure-controlled summarization is recently proposed as a useful and interesting research direction. However, current structure-controlling methods have limited effectiveness in enforcing the desired structure. To address this limitation, we propose a sentence-level beam search generation method (SentBS), where evaluation is conducted throughout the generation process to select suitable sentences for subsequent generations. We experiment with different combinations of decoding methods to be used as sub-components by SentBS and evaluate results on the structure-controlled dataset MReD. Experiments show that all explored combinations for SentBS can improve the agreement between the generated text and the desired structure, with the best method significantly reducing the structural discrepancies suffered by the existing model, by approximately 68%.", "corpusId": "253116838"}
{"paperId": "f8945320d381510ef5a313fdf53b01932c8c5fe3", "title": "Human-Like Decision Making: Document-level Aspect Sentiment Classification via Hierarchical Reinforcement Learning", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2019, "citationCount": 23, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D19-1560.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1910.09260, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "authors": [{"authorId": "2109839506", "name": "Jingjing Wang"}, {"authorId": "2060934", "name": "Changlong Sun"}, {"authorId": "2109167274", "name": "Shoushan Li"}, {"authorId": "49606852", "name": "Jiancheng Wang"}, {"authorId": "2059080424", "name": "Luo Si"}, {"authorId": "2156053331", "name": "Min Zhang"}, {"authorId": "1713802", "name": "Xiaozhong Liu"}, {"authorId": "143740945", "name": "Guodong Zhou"}], "abstract": "Recently, neural networks have shown promising results on Document-level Aspect Sentiment Classification (DASC). However, these approaches often offer little transparency w.r.t. their inner working mechanisms and lack interpretability. In this paper, to simulating the steps of analyzing aspect sentiment in a document by human beings, we propose a new Hierarchical Reinforcement Learning (HRL) approach to DASC. This approach incorporates clause selection and word selection strategies to tackle the data noise problem in the task of DASC. First, a high-level policy is proposed to select aspect-relevant clauses and discard noisy clauses. Then, a low-level policy is proposed to select sentiment-relevant words and discard noisy words inside the selected clauses. Finally, a sentiment rating predictor is designed to provide reward signals to guide both clause and word selection. Experimental results demonstrate the impressive effectiveness of the proposed approach to DASC over the state-of-the-art baselines.", "corpusId": "202770194"}
{"paperId": "598231eb906b183f7a2a408ef4536127e11e3de9", "title": "Challenges and Strategies in Cross-Cultural NLP", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "citationCount": 219, "openAccessPdf": {"url": "http://arxiv.org/pdf/2203.10020", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2203.10020, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-03-18", "authors": [{"authorId": "2064295987", "name": "Daniel Hershcovich"}, {"authorId": "37922370", "name": "Stella Frank"}, {"authorId": "49568895", "name": "Heather Lent"}, {"authorId": "3295381", "name": "Miryam de Lhoneux"}, {"authorId": "30671790", "name": "Mostafa Abdou"}, {"authorId": "6547490", "name": "Stephanie Brandl"}, {"authorId": "83574123", "name": "Emanuele Bugliarello"}, {"authorId": "2093582149", "name": "Laura Cabello Piqueras"}, {"authorId": "2125376289", "name": "Ilias Chalkidis"}, {"authorId": "1717462692", "name": "Ruixiang Cui"}, {"authorId": "50110151", "name": "Constanza Fierro"}, {"authorId": "82259306", "name": "Katerina Margatina"}, {"authorId": "1660797358", "name": "Phillip Rust"}, {"authorId": "1700187", "name": "Anders Søgaard"}], "abstract": "Various efforts in the Natural Language Processing (NLP) community have been made to accommodate linguistic diversity and serve speakers of many different languages. However, it is important to acknowledge that speakers and the content they produce and require, vary not just by language, but also by culture. Although language and culture are tightly linked, there are important differences. Analogous to cross-lingual and multilingual NLP, cross-cultural and multicultural NLP considers these differences in order to better serve users of NLP systems. We propose a principled framework to frame these efforts, and survey existing and potential strategies.", "corpusId": "247594499"}
{"paperId": "1b9ce8d80a7b502e632b957b710708bfb18eec0e", "title": "Great Chain of Agents: The Role of Metaphorical Representation of Agents in Conversational Crowdsourcing", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "citationCount": 45, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3491102.3517653", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3491102.3517653?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3491102.3517653, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-04-27", "authors": [{"authorId": "2130912558", "name": "Jiyun Jung"}, {"authorId": "26413660", "name": "S. Qiu"}, {"authorId": "1710630", "name": "A. Bozzon"}, {"authorId": "2516584", "name": "U. Gadiraju"}], "abstract": "Conversational agents are being widely adopted across several domains to serve a variety of purposes ranging from providing intelligent assistance to companionship. Recent literature has shown that users develop intuitive folk theories and a metaphorical understanding of conversational agents (CAs) due to the lack of a mental model of the agents. However, investigation of metaphorical agent representation in the HCI community has mainly focused on the human level, despite non-human metaphors for agents being prevalent in the real world. We adopted Lakoff and Turner’s ‘Great Chain of Being’ framework to systematically investigate the impact of using non-human metaphors to represent conversational agents on worker engagement in crowdsourcing marketplaces. We designed a text-based conversational agent that assists crowd workers in task execution. Through a between-subjects experimental study (N = 341), we explored how different human and non-human metaphors affect worker engagement, the perceived cognitive load of workers, intrinsic motivation, and their trust in the agents. Our findings bridge the gap of how users experience CAs with non-human metaphors in the context of conversational crowdsourcing.", "corpusId": "248419779"}
{"paperId": "4f61acf2b7fb33295ee92f8454721af2ec7316f3", "title": "Seeing is Believing: Exploring Perceptual Differences in DeepFake Videos", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 63, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3411764.3445699?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3411764.3445699, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-05-06", "authors": [{"authorId": "2436653", "name": "Rashid Tahir"}, {"authorId": "2068509634", "name": "Brishna Batool"}, {"authorId": "2093574784", "name": "Hira Jamshed"}, {"authorId": "2093568033", "name": "Mahnoor Jameel"}, {"authorId": "2093566051", "name": "Mubashir Anwar"}, {"authorId": "2054472675", "name": "Faizan Ahmed"}, {"authorId": "2761498", "name": "M. Zaffar"}, {"authorId": "3409533", "name": "Muhammad Fareed Zaffar"}], "abstract": "With AI on the boom, DeepFakes have emerged as a tool with a massive potential for abuse. The hyper-realistic imagery of these manipulated videos coupled with the expedited delivery models of social media platforms gives deception, propaganda, and disinformation an entirely new meaning. Hence, raising awareness about DeepFakes and how to accurately flag them has become imperative. However, given differences in human cognition and perception, this is not straightforward. In this paper, we perform an investigative user study and also analyze existing AI detection algorithms from the literature to demystify the unknowns that are at play behind the scenes when detecting DeepFakes. Based on our findings, we design a customized training program to improve detection and evaluate on a treatment group of low-literate population, which is most vulnerable to DeepFakes. Our results suggest that, while DeepFakes are becoming imperceptible, contextualized education and training can help raise awareness and improve detection.", "corpusId": "233987624"}
{"paperId": "3200e16772cd05c63f08027adf842b24a4f1f64d", "title": "Out of Context: Investigating the Bias and Fairness Concerns of “Artificial Intelligence as a Service”", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "citationCount": 30, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3544548.3581463", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2302.01448, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2023-02-02", "authors": [{"authorId": "2204464979", "name": "Kornel Lewicki"}, {"authorId": "1739477817", "name": "M. S. Lee"}, {"authorId": "40915668", "name": "Jennifer Cobbe"}, {"authorId": "2109471576", "name": "Jatinder Singh"}], "abstract": "“AI as a Service” (AIaaS) is a rapidly growing market, offering various plug-and-play AI services and tools. AIaaS enables its customers (users)—who may lack the expertise, data, and/or resources to develop their own systems—to easily build and integrate AI capabilities into their applications. Yet, it is known that AI systems can encapsulate biases and inequalities that can have societal impact. This paper argues that the context-sensitive nature of fairness is often incompatible with AIaaS’ ‘one-size-fits-all’ approach, leading to issues and tensions. Specifically, we review and systematise the AIaaS space by proposing a taxonomy of AI services based on the levels of autonomy afforded to the user. We then critically examine the different categories of AIaaS, outlining how these services can lead to biases or be otherwise harmful in the context of end-user applications. In doing so, we seek to draw research attention to the challenges of this emerging area.", "corpusId": "256598258"}
{"paperId": "cc26c8dae566a7aed07179db77c1cc0d5ca427db", "title": "ProSeqo: Projection Sequence Networks for On-Device Text Classification", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2019, "citationCount": 8, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D19-1402.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/D19-1402, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-11-01", "authors": [{"authorId": "1714932", "name": "Zornitsa Kozareva"}, {"authorId": "120209444", "name": "Sujith Ravi"}], "abstract": "We propose a novel on-device sequence model for text classification using recurrent projections. Our model ProSeqo uses dynamic recurrent projections without the need to store or look up any pre-trained embeddings. This results in fast and compact neural networks that can perform on-device inference for complex short and long text classification tasks. We conducted exhaustive evaluation on multiple text classification tasks. Results show that ProSeqo outperformed state-of-the-art neural and on-device approaches for short text classification tasks such as dialog act and intent prediction. To the best of our knowledge, ProSeqo is the first on-device long text classification neural model. It achieved comparable results to previous neural approaches for news article, answers and product categorization, while preserving small memory footprint and maintaining high accuracy.", "corpusId": "202780043"}
{"paperId": "112fd54ee193237b24f2ce7fce79e399609a29c5", "title": "The Bottom-up Evolution of Representations in the Transformer: A Study with Machine Translation and Language Modeling Objectives", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2019, "citationCount": 198, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/D19-1448.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/1909.01380, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-03", "authors": [{"authorId": "46235299", "name": "Elena Voita"}, {"authorId": "2082372", "name": "Rico Sennrich"}, {"authorId": "144889265", "name": "Ivan Titov"}], "abstract": "We seek to understand how the representations of individual tokens and the structure of the learned feature space evolve between layers in deep neural networks under different learning objectives. We chose the Transformers for our analysis as they have been shown effective with various tasks, including machine translation (MT), standard left-to-right language models (LM) and masked language modeling (MLM). Previous work used black-box probing tasks to show that the representations learned by the Transformer differ significantly depending on the objective. In this work, we use canonical correlation analysis and mutual information estimators to study how information flows across Transformer layers and observe that the choice of the objective determines this process. For example, as you go from bottom to top layers, information about the past in left-to-right language models gets vanished and predictions about the future get formed. In contrast, for MLM, representations initially acquire information about the context around the token, partially forgetting the token identity and producing a more generalized token representation. The token identity then gets recreated at the top MLM layers.", "corpusId": "202541078"}
{"paperId": "1dca2f0196916a7fbc645660d7ced8b96fbff261", "title": "Robots for Inclusive Play: Co-designing an Educational Game With Visually Impaired and sighted Children", "venue": "International Conference on Human Factors in Computing Systems", "year": 2020, "citationCount": 95, "openAccessPdf": {"url": "https://hal.archives-ouvertes.fr/hal-02926484/file/Metatla%20et%20al.%20-%202020%20-%20Conference%20on%20Human%20Factors%20in%20Computing%20Systems%20-%20Proceedings%20-%20Robots%20for%20Inclusive%20Play%20Co-designing%20an%20Educa.pdf", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3313831.3376270?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3313831.3376270, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Psychology", "Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-04-21", "authors": [{"authorId": "3149441", "name": "Oussama Metatla"}, {"authorId": "40050668", "name": "Sandra Bardot"}, {"authorId": "40963754", "name": "Clare Cullen"}, {"authorId": "145806983", "name": "M. Serrano"}, {"authorId": "1733240", "name": "C. Jouffrais"}], "abstract": "Despite being included in mainstream schools, visually impaired children still face barriers to social engagement and participation. Games could potentially help, but games that cater for both visually impaired and sighted players are scarce. We used a co-design approach to design and evaluate a robot-based educational game that could be inclusive of both visually impaired and sighted children in the context of mainstream education. We ran a focus group discussion with visual impairment educators to understand barriers to inclusive play. And then a series of co-design workshops to engage visually impaired and sighted children and educators in learning about robot technology and exploring its potential to support inclusive play experiences. We present design guidelines and an evaluation workshop of a game prototype, demonstrating group dynamics conducive to collaborative learning experiences, including shared goal setting/execution, closely coupled division of labour, and interaction symmetry.", "corpusId": "218483278"}
{"paperId": "7e08e52cc3adcee7f580a4a1063498f636753cc0", "title": "Older Adults Using Technology for Meaningful Activities During COVID-19: An Analysis Through the Lens of Self-Determination Theory", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "citationCount": 28, "openAccessPdf": {"url": "https://doi.org/10.1145/3544548.3580839", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3544548.3580839?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3544548.3580839, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-04-19", "authors": [{"authorId": "73723535", "name": "Wei Zhao"}, {"authorId": "48346195", "name": "Ryan M. Kelly"}, {"authorId": "3396617", "name": "Melissa J. Rogerson"}, {"authorId": "2802065", "name": "Jenny Waycott"}], "abstract": "Restrictions during the COVID-19 pandemic significantly affected people's opportunities to engage in activities that are meaningful to their lives. In response to these constraints, many people, including older adults, turned to digital technologies as alternative ways to pursue meaningful activities. These technology-mediated activities, however, presented new challenges for older adults’ everyday use of technology. In this paper, we investigate how older adults used digital technologies for meaningful activities during COVID-19 restrictions. We conducted in-depth interviews with 40 older adults and analyzed the interview data through the lens of self-determination theory (SDT). Our analysis shows that using digital technologies for meaningful activities can both support and undermine older people's three basic psychological needs for autonomy, competence, and relatedness. We argue that future technologies should be designed to empower older adults’ content creation, engagement in personal interests, exploration of technology, effortful communication, and participation in beneficent activities.", "corpusId": "258218261"}
{"paperId": "b17365e060189bf6708ec4411be185f7901d56f9", "title": "FaceWidgets: Exploring Tangible Interaction on Face with Head-Mounted Displays", "venue": "ACM Symposium on User Interface Software and Technology", "year": 2019, "citationCount": 16, "openAccessPdf": {"url": "", "status": null, "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3332165.3347946?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3332165.3347946, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-10-17", "authors": [{"authorId": "2107247", "name": "Wen-Jie Tseng"}, {"authorId": "2108950266", "name": "Li-Yang Wang"}, {"authorId": "3212475", "name": "Liwei Chan"}], "abstract": "We present FaceWidgets, a device integrated with the backside of a head-mounted display (HMD) that enables tangible interactions using physical controls. To allow for near range-to-eye interactions, our first study suggested displaying the virtual widgets at 20 cm from the eye positions, which is 9 cm from the HMD backside. We propose two novel interactions, widget canvas and palm-facing gesture, that can help users avoid double vision and allow them to access the interface as needed. Our second study showed that displaying a hand reference improved performance of face widgets interactions. We developed two applications of FaceWidgets, a fixed-layout 360 video player and a contextual input for smart home control. Finally, we compared four hand visualizations against the two applications in an exploratory study. Participants considered the transparent hand as the most suitable and responded positively to our system.", "corpusId": "204812029"}
{"paperId": "78d7703a5fde805abf8262a7864dcb496c2e866d", "title": "Augmented Reality Glasses as an Orientation and Mobility Aid for People with Low Vision: a Feasibility Study of Experiences and Requirements", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 40, "openAccessPdf": {"url": "https://orca.cardiff.ac.uk/id/eprint/137821/1/Clean%20pdf.pdf", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3411764.3445327?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3411764.3445327, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-05-06", "authors": [{"authorId": "1693380475", "name": "H. Htike"}, {"authorId": "3423501", "name": "T. Margrain"}, {"authorId": "7827503", "name": "Yu-Kun Lai"}, {"authorId": "2291394", "name": "Parisa Eslambolchilar"}], "abstract": "People with low vision experience reduced mobility that affects their physical and mental wellbeing. With augmented reality (AR) glasses, there are new opportunities to provide visual and auditory information that can improve mobility for this vulnerable group. Current research into AR-based mobility aids has focused mainly on the technical aspects, and less emphasis has been placed on understanding the usability and suitability of these aids in people with various levels of visual impairment. In this paper, we present the results of qualitative interviews with 18 participants using HoloLens v1 and eight prototype augmentations to understand how these enhancements are perceived by people with low vision and how these aids should be adjusted to suit their needs. Our results suggested that participants with moderate vision loss could potentially perceive the most benefit from glasses and underlined the importance of extensive customizability to accommodate the needs of a highly varied low vision population.", "corpusId": "233987817"}
{"paperId": "4bbafce8de5301222f236784dfa23217636963e4", "title": "Overleaf Example", "venue": "", "year": 2021, "citationCount": 5, "openAccessPdf": {"url": "", "status": null, "license": null}, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "authors": [{"authorId": "51043791", "name": "A. Kalyan"}, {"authorId": "2130301426", "name": "Abhinav Kumar"}, {"authorId": "34719258", "name": "Arjun Chandrasekaran"}, {"authorId": "48229640", "name": "Ashish Sabharwal"}, {"authorId": "48323507", "name": "Peter Clark"}], "abstract": null, "corpusId": "239998631"}
{"paperId": "c590c7b56282301d9be67d9f036e5d037787971d", "title": "Parsing Gapping Constructions Based on Grammatical and Semantic Roles", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 2, "openAccessPdf": {"url": "https://doi.org/10.18653/v1/2020.emnlp-main.218", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2020.emnlp-main.218, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "authors": [{"authorId": "2092552", "name": "Yoshihide Kato"}, {"authorId": "49145907", "name": "S. Matsubara"}], "abstract": "A gapping construction consists of a coordinated structure where redundant elements are elided from all but one conjuncts. This paper proposes a method of parsing sentences with gapping to recover elided elements. The proposed method is based on constituent trees annotated with grammatical and semantic roles that are useful for identifying elided elements. Our method outperforms the previous method in terms of F-measure and recall.", "corpusId": "226283519"}
{"paperId": "89d4786dbe14fd058f89d867736e1cdb50660cb6", "title": "High Costs and Small Benefits: A Field Study of How Users Experience Operating System Upgrades", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 34, "openAccessPdf": {"url": "https://hal.archives-ouvertes.fr/hal-01493415/file/CHI_2017_Upgrades.pdf", "status": "GREEN", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3025509?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3025509, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "1639965739", "name": "F. Vitale"}, {"authorId": "1713735", "name": "Joanna McGrenere"}, {"authorId": "2457286", "name": "A. Tabard"}, {"authorId": "1401678555", "name": "M. Beaudouin-Lafon"}, {"authorId": "1732917", "name": "W. Mackay"}], "abstract": null, "corpusId": "215808363"}
{"paperId": "73bcf4577284fa116ee73487b7cbb85c8266eaa0", "title": "Understanding and Overcoming the Challenges of Efficient Transformer Quantization", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 170, "openAccessPdf": {"url": "https://aclanthology.org/2021.emnlp-main.627.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2109.12948, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-27", "authors": [{"authorId": "2112207572", "name": "Yelysei Bondarenko"}, {"authorId": "41229153", "name": "Markus Nagel"}, {"authorId": "83133279", "name": "Tijmen Blankevoort"}], "abstract": "Transformer-based architectures have become the de-facto standard models for a wide range of Natural Language Processing tasks. However, their memory footprint and high latency are prohibitive for efficient deployment and inference on resource-limited devices. In this work, we explore quantization for transformers. We show that transformers have unique quantization challenges – namely, high dynamic activation ranges that are difficult to represent with a low bit fixed-point format. We establish that these activations contain structured outliers in the residual connections that encourage specific attention patterns, such as attending to the special separator token. To combat these challenges, we present three solutions based on post-training quantization and quantization-aware training, each with a different set of compromises for accuracy, model size, and ease of use. In particular, we introduce a novel quantization scheme – per-embedding-group quantization. We demonstrate the effectiveness of our methods on the GLUE benchmark using BERT, establishing state-of-the-art results for post-training quantization. Finally, we show that transformer weights and embeddings can be quantized to ultra-low bit-widths, leading to significant memory savings with a minimum accuracy loss. Our source code is available at https://github.com/qualcomm-ai-research/transformer-quantization.", "corpusId": "237940329"}
{"paperId": "5e674bc803123aa87a0526c0f3bc6dba125cea91", "title": "Overlooking Context: How do Defaults and Framing Reduce Deliberation in Smart Home Privacy Decision-Making?", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "citationCount": 22, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3411764.3445672?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3411764.3445672, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-05-06", "authors": [{"authorId": "36099145", "name": "Paritosh Bahirat"}, {"authorId": "1918235", "name": "M. Willemsen"}, {"authorId": "46968553", "name": "Yangyang He"}, {"authorId": "3374837", "name": "Qizhang Sun"}, {"authorId": "2477993", "name": "Bart P. Knijnenburg"}], "abstract": "Research has demonstrated that users’ heuristic decision-making processes cause external factors like defaults and framing to influence the outcome of privacy decisions. Proponents of “privacy nudging” have proposed leveraging these effects to guide users’ decisions. Our research shows that defaults and framing not only influence the outcome of privacy decisions, but also the process of evaluating the contextual factors associated with the decision, effectively making the decision-making process more heuristic. In our analysis of an existing dataset of scenario-based smart home privacy decisions, we demonstrate that defaults and framing not only have a direct effect on participants’ decisions; they also moderate the effect of their cognitive appraisals of the presented scenarios on the decision. These results suggest that nudges like defaults and framing exacerbate the well-researched problem that people often employ heuristics rather than making deliberate privacy decisions, and that privacy-setting interfaces should avoid the effects of heuristic decision-making.", "corpusId": "233987121"}
{"paperId": "21582e7d034797ce2e2ee681af4316accacbc1b4", "title": "“Just Not Together”: The Experience of Videoconferencing for People with Aphasia during the Covid-19 Pandemic", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "citationCount": 33, "openAccessPdf": {"url": "https://dl.acm.org/doi/pdf/10.1145/3491102.3502017", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3491102.3502017?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3491102.3502017, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-29", "authors": [{"authorId": "2757539", "name": "Timothy Neate"}, {"authorId": "15815082", "name": "Vasiliki Kladouchou"}, {"authorId": "143634892", "name": "Stephanie M. Wilson"}, {"authorId": "2163711897", "name": "Shehzmani Shams"}], "abstract": "People with language impairments, such as aphasia, use a range of total communication strategies. These go beyond spoken language to include non-verbal utterances, props and gestures. The uptake of videoconferencing platforms necessitated by the Covid-19 pandemic means that people with aphasia now use these communication strategies online. However, no data exists on the impact of videoconferencing on communication for this population. Working with an aphasia charity that moved its conversation support sessions online, we investigated the experience of communication via a videoconferencing platform. We report a study which investigated this through: 1) observations of online conversation support sessions; 2) interviews with speech and language therapists and volunteers; and 3) interviews with people with aphasia. Our findings reveal the unique and creative ways that the charity and its members with aphasia adapted their communication to videoconferencing. We unpack specific, novel challenges relating to total communication via videoconferencing and the related impacts on social and privacy issues.", "corpusId": "248420025"}
{"paperId": "96ec36b493eac68fa494bab94b80a201d79edcd2", "title": "Thumb + Pen Interaction on Tablets", "venue": "International Conference on Human Factors in Computing Systems", "year": 2017, "citationCount": 55, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3025453.3025567?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3025453.3025567, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-02", "authors": [{"authorId": "3171800", "name": "Ken Pfeuffer"}, {"authorId": "1738072", "name": "K. Hinckley"}, {"authorId": "2025763", "name": "M. Pahud"}, {"authorId": "145884449", "name": "W. Buxton"}], "abstract": null, "corpusId": "20930622"}
{"paperId": "6745aa1ed9dcbaa6679ea7160f053c63cbc5a122", "title": "A Badge, Not a Barrier: Designing for-and Throughout-Digital Badge Implementation", "venue": "International Conference on Human Factors in Computing Systems", "year": 2019, "citationCount": 6, "openAccessPdf": {"url": "https://doi.org/10.1145/3290605.3300920", "status": "BRONZE", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3290605.3300920?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3290605.3300920, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2019-05-02", "authors": [{"authorId": "3435717", "name": "Caroline Pitt"}, {"authorId": "17221494", "name": "A. Bell"}, {"authorId": "2064747145", "name": "Edgar Onofre"}, {"authorId": "145002926", "name": "K. Davis"}], "abstract": "We synthesize insights from a multi-year project involving the design and implementation of a digital badge system with youth co-designers at a science center. Using stakeholder interviews and surveys, participatory design session data, and user analytics, we identify the sociotechnical, sociocultural, and technical challenges of long-term badge implementation and propose several recommendations for the design and implementation of future badge systems. By identifying these challenges and providing recommendations that foreground stakeholder values and participation, we show how to support implementation throughout the entire design-to-implementation cycle.", "corpusId": "140223047"}
{"paperId": "3d3f8399d625238fddb366697acb73446129d65c", "title": "Revisiting Pre-trained Language Models and their Evaluation for Arabic Natural Language Processing", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "citationCount": 8, "openAccessPdf": {"url": "https://aclanthology.org/2022.emnlp-main.205.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2022.emnlp-main.205, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "3448973", "name": "Abbas Ghaddar"}, {"authorId": "2000863903", "name": "Yimeng Wu"}, {"authorId": "32559189", "name": "Sunyam Bagga"}, {"authorId": "2064509318", "name": "Ahmad Rashid"}, {"authorId": "2127601849", "name": "Khalil Bibi"}, {"authorId": "2066076226", "name": "Mehdi Rezagholizadeh"}, {"authorId": "2064677272", "name": "Chao Xing"}, {"authorId": "2136912252", "name": "Yasheng Wang"}, {"authorId": "2067780435", "name": "Xinyu Duan"}, {"authorId": "2243403387", "name": "Zhefeng Wang"}, {"authorId": "2422046", "name": "Baoxing Huai"}, {"authorId": "2110310493", "name": "Xin Jiang"}, {"authorId": "30738758", "name": "Qun Liu"}, {"authorId": "1724343955", "name": "P. Langlais"}], "abstract": "There is a growing body of work in recent years to develop pre-trained language models (PLMs) for the Arabic language. This work addresses two major problems in existing Arabic PLMs that limit the progress of the Arabic NLU and NLG fields. First, existing Arabic PLMs are not well-explored and their pre-training can be improved significantly using a more methodical approach. Second, there is a lack of systematic and reproducible evaluation of these models in the literature. We revisit both the pre-training and evaluation of Arabic PLMs. In terms of pre-training, we explore the impact of the quality of the pretraining data, the size of the model, and the incorporation of character-level information on Arabic PLM. As a result, we release three new Arabic BERT-style models ( JABER, Char-JABER, and SABER), and two T5-style models (AT5S and AT5B). In terms of evaluation, we conduct a comprehensive empirical study to systematically evaluate the performance of existing state-of-the-art models on ALUE, a leaderboard-powered benchmark for Arabic NLU tasks, and on a subset of the Arabic generative tasks. We show that our models significantly outperform existing Arabic PLMs and achieve a new state-of-the-art performance on discriminative and generative Arabic NLU and NLG tasks. Our models and source code to reproduce results will be made available upon acceptance.", "corpusId": "256461267"}
{"paperId": "59a80f6db564693535ef23a8b0f9034023842f6e", "title": "Unimodal and Crossmodal Refinement Network for Multimodal Sequence Fusion", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "citationCount": 4, "openAccessPdf": {"url": "https://doi.org/10.18653/v1/2021.emnlp-main.720", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://aclanthology.org/2021.emnlp-main.720, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "authors": [{"authorId": "151479832", "name": "Xiaobao Guo"}, {"authorId": "2142289554", "name": "A. Kong"}, {"authorId": "2146382949", "name": "Huan Zhou"}, {"authorId": "2118633869", "name": "Xianfeng Wang"}, {"authorId": "2145298888", "name": "Min Wang"}], "abstract": "Effective unimodal representation and complementary crossmodal representation fusion are both important in multimodal representation learning. Prior works often modulate one modal feature to another straightforwardly and thus, underutilizing both unimodal and crossmodal representation refinements, which incurs a bottleneck of performance improvement. In this paper, Unimodal and Crossmodal Refinement Network (UCRN) is proposed to enhance both unimodal and crossmodal representations. Specifically, to improve unimodal representations, a unimodal refinement module is designed to refine modality-specific learning via iteratively updating the distribution with transformer-based attention layers. Self-quality improvement layers are followed to generate the desired weighted representations progressively. Subsequently, those unimodal representations are projected into a common latent space, regularized by a multimodal Jensen-Shannon divergence loss for better crossmodal refinement. Lastly, a crossmodal refinement module is employed to integrate all information. By hierarchical explorations on unimodal, bimodal, and trimodal interactions, UCRN is highly robust against missing modality and noisy data. Experimental results on MOSI and MOSEI datasets illustrated that the proposed UCRN outperforms recent state-of-the-art techniques and its robustness is highly preferred in real multimodal sequence fusion scenarios. Codes will be shared publicly.", "corpusId": "243865667"}
{"paperId": "b37c3c2ae4571e6e96f5dbcf39c0b4a744810597", "title": "GRADE: Automatic Graph-Enhanced Coherence Metric for Evaluating Open-Domain Dialogue Systems", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2020, "citationCount": 108, "openAccessPdf": {"url": "https://www.aclweb.org/anthology/2020.emnlp-main.742.pdf", "status": "HYBRID", "license": "CCBY", "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2010.03994, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-08", "authors": [{"authorId": "2111011466", "name": "Lishan Huang"}, {"authorId": "83368021", "name": "Zheng Ye"}, {"authorId": "9102638", "name": "Jinghui Qin"}, {"authorId": "1737218", "name": "Liang Lin"}, {"authorId": "13246332", "name": "Xiaodan Liang"}], "abstract": "Automatically evaluating dialogue coherence is a challenging but high-demand ability for developing high-quality open-domain dialogue systems. However, current evaluation metrics consider only surface features or utterance-level semantics, without explicitly considering the fine-grained topic transition dynamics of dialogue flows. Here, we first consider that the graph structure constituted with topics in a dialogue can accurately depict the underlying communication logic, which is a more natural way to produce persuasive metrics. Capitalized on the topic-level dialogue graph, we propose a new evaluation metric GRADE, which stands for Graph-enhanced Representations for Automatic Dialogue Evaluation. Specifically, GRADE incorporates both coarse-grained utterance-level contextualized representations and fine-grained topic-level graph representations to evaluate dialogue coherence. The graph representations are obtained by reasoning over topic-level dialogue graphs enhanced with the evidence from a commonsense graph, including k-hop neighboring representations and hop-attention weights. Experimental results show that our GRADE significantly outperforms other state-of-the-art metrics on measuring diverse dialogue models in terms of the Pearson and Spearman correlations with human judgements. Besides, we release a new large-scale human evaluation benchmark to facilitate future research on automatic metrics.", "corpusId": "222209112"}
{"paperId": "ed2f451e23e17d703a664f3a0b44a5125e3069a4", "title": "A Multitask Learning Approach for Diacritic Restoration", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2020, "citationCount": 17, "openAccessPdf": {"url": "https://arxiv.org/pdf/2006.04016", "status": "GREEN", "license": null, "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2006.04016, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-06-01", "authors": [{"authorId": "23644119", "name": "Sawsan Alqahtani"}, {"authorId": "50997098", "name": "Ajay K. Mishra"}, {"authorId": "1700007", "name": "Mona T. Diab"}], "abstract": "In many languages like Arabic, diacritics are used to specify pronunciations as well as meanings. Such diacritics are often omitted in written text, increasing the number of possible pronunciations and meanings for a word. This results in a more ambiguous text making computational processing on such text more difficult. Diacritic restoration is the task of restoring missing diacritics in the written text. Most state-of-the-art diacritic restoration models are built on character level information which helps generalize the model to unseen data, but presumably lose useful information at the word level. Thus, to compensate for this loss, we investigate the use of multi-task learning to jointly optimize diacritic restoration with related NLP problems namely word segmentation, part-of-speech tagging, and syntactic diacritization. We use Arabic as a case study since it has sufficient data resources for tasks that we consider in our joint modeling. Our joint models significantly outperform the baselines and are comparable to the state-of-the-art models that are more complex relying on morphological analyzers and/or a lot more data (e.g. dialectal data).", "corpusId": "219531150"}
{"paperId": "96d267ba527eec7bfe7f6e5106cd3d10aaf195be", "title": "Youth Advocacy in SNAs: Challenges for Addressing Health Disparities", "venue": "International Conference on Human Factors in Computing Systems", "year": 2016, "citationCount": 10, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/2858036.2858492?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/2858036.2858492, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science", "Sociology"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2016-05-07", "authors": [{"authorId": "3387394", "name": "Farnaz Irannejad Bisafar"}, {"authorId": "3358092", "name": "Herman Saksono"}, {"authorId": "3395953", "name": "P. Baquerizo"}, {"authorId": "2114878088", "name": "Dana Moore"}, {"authorId": "143644649", "name": "A. Parker"}], "abstract": null, "corpusId": "34283698"}
{"paperId": "455155911d9334273110c631592e37c0960819a6", "title": "Multi-Touch Skin: A Thin and Flexible Multi-Touch Sensor for On-Skin Input", "venue": "International Conference on Human Factors in Computing Systems", "year": 2018, "citationCount": 96, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'abstract'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1145/3173574.3173607?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1145/3173574.3173607, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-04-19", "authors": [{"authorId": null, "name": "Aditya Shekhar Nittala"}, {"authorId": "2372229698", "name": "Anusha I. Withana"}, {"authorId": "31393665", "name": "Narjes Pourjafarian"}, {"authorId": "144455572", "name": "Jürgen Steimle"}], "abstract": null, "corpusId": "5040497"}
